[
    {
        "type": "race",
        "name": "Satyr",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "1",
        "cha": "2",
        "wis": "0",
        "source_name": "MOT",
        "RacialTraits": [
            {
                "race_name": "Satyr",
                "name": "Alignment",
                "source_name": "MOT",
                "text": "Satyrs delight in living a life free of the mantle of law. They gravitate toward being good, but some have devious streaks and enjoy causing dismay."
            },
            {
                "race_name": "Satyr",
                "name": "Fey",
                "source_name": "MOT",
                "text": "Your creature type is fey, rather than humanoid."
            },
            {
                "race_name": "Satyr",
                "name": "Size",
                "source_name": "MOT",
                "text": "Satyrs range from just under 5 feet to about 6 feet in height, with generally slender builds. Your size is Medium."
            },
            {
                "race_name": "Satyr",
                "name": "Ram",
                "source_name": "MOT",
                "text": "You can use your head and horns to make unarmed strikes. If you hit with them, you deal bludgeoning damage equal to {@damage 1d4} + your Strength modifier."
            },
            {
                "race_name": "Satyr",
                "name": "Reveler",
                "source_name": "MOT",
                "text": "You have proficiency in the {@skill Performance} and {@skill Persuasion} skills, and you have proficiency with one musical instrument of your choice."
            },
            {
                "race_name": "Satyr",
                "name": "Languages",
                "source_name": "MOT",
                "text": "You can speak, read, and write Common and Sylvan."
            },
            {
                "race_name": "Satyr",
                "name": "Age",
                "source_name": "MOT",
                "text": "Satyrs mature and age at about the same rate as humans."
            },
            {
                "race_name": "Satyr",
                "name": "Mirthful Leaps",
                "source_name": "MOT",
                "text": "Whenever you make a long or high jump, you can roll a {@dice d8} and add the number rolled to the number of feet you cover, even when making a standing jump. This extra distance costs movement as normal."
            },
            {
                "race_name": "Satyr",
                "name": "Magic Resistance",
                "source_name": "MOT",
                "text": "You have advantage on saving throws against spells and other magical effects."
            }
        ]
    },
    {
        "type": "race",
        "name": "Dwarf",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "PHB",
        "RacialTraits": [
            {
                "race_name": "Dwarf",
                "name": "Languages",
                "source_name": "PHB",
                "text": "You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
            },
            {
                "race_name": "Dwarf",
                "name": "Tool Proficiency",
                "source_name": "PHB",
                "text": "You gain proficiency with the artisan's tools of your choice: {@item Smith's tools|phb}, {@item brewer's supplies|phb}, or {@item mason's tools|phb}."
            },
            {
                "race_name": "Dwarf",
                "name": "Size",
                "source_name": "PHB",
                "text": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium."
            },
            {
                "race_name": "Dwarf",
                "name": "Stonecunning",
                "source_name": "PHB",
                "text": "Whenever you make an Intelligence ({@skill History}) check related to the origin of stonework, you are considered proficient in the {@skill History} skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
            },
            {
                "race_name": "Dwarf",
                "name": "Speed",
                "source_name": "PHB",
                "text": "Your speed is not reduced by wearing heavy armor."
            },
            {
                "race_name": "Dwarf",
                "name": "Age",
                "source_name": "PHB",
                "text": "Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years."
            },
            {
                "race_name": "Dwarf",
                "name": "Darkvision",
                "source_name": "PHB",
                "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Dwarf",
                "name": "Dwarven Combat Training",
                "source_name": "PHB",
                "text": "You have proficiency with the {@item battleaxe|phb}, {@item handaxe|phb}, {@item light hammer|phb}, and {@item warhammer|phb}."
            },
            {
                "race_name": "Dwarf",
                "name": "Dwarven Resilience",
                "source_name": "PHB",
                "text": "You have advantage on saving throws against poison, and you have resistance against poison damage."
            }
        ]
    },
    {
        "type": "race",
        "name": "Kobold",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Kobold",
                "name": "Kobold Legacy",
                "source_name": "MPMM",
                "text": "Kobold's connections to dragons can manifest in unpredictable ways in an individual kobold. Choose one of the following legacy options for your kobold.,[object Object]"
            },
            {
                "race_name": "Kobold",
                "name": "Draconic Cry",
                "source_name": "MPMM",
                "text": "As a bonus action, you let out a cry at your enemies within 10 feet of you. Until the start of your next turn, you and your allies have advantage on attack rolls against any of those enemies who could hear you. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Kobold",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were in dim light. You discern colors in that darkness only as shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Satyr",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Satyr",
                "name": "Mirthful Leaps",
                "source_name": "MPMM",
                "text": "Whenever you make a long jump or a high jump, you can roll a {@dice d8} and add the number rolled to the number of feet you cover, even when making a standing jump. This extra distance costs movement as usual."
            },
            {
                "race_name": "Satyr",
                "name": "Reveler",
                "source_name": "MPMM",
                "text": "As an embodiment of revelry, you have proficiency in the {@skill Performance} and {@skill Persuasion} skills, and you have proficiency with one {@item musical instrument|PHB} of your choice."
            },
            {
                "race_name": "Satyr",
                "name": "Magic Resistance",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws against spells."
            },
            {
                "race_name": "Satyr",
                "name": "Ram",
                "source_name": "MPMM",
                "text": "You can use your head and horns to make unarmed strikes. When you hit with them, the strike deals {@damage 1d6} + your Strength modifier bludgeoning damage, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Satyr",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Fey."
            }
        ]
    },
    {
        "type": "race",
        "name": "Aasimar",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "2",
        "wis": "0",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Aasimar",
                "name": "Celestial Resistance",
                "source_name": "VGM",
                "text": "You have resistance to necrotic damage and radiant damage."
            },
            {
                "race_name": "Aasimar",
                "name": "Healing Hands",
                "source_name": "VGM",
                "text": "As an action, you can touch a creature and cause it to regain a number of hit points equal to your level. Once you use this trait, you can't use it again until you finish a long rest."
            },
            {
                "race_name": "Aasimar",
                "name": "Size",
                "source_name": "VGM",
                "text": "Aasimar have the same range of height and weight as humans."
            },
            {
                "race_name": "Aasimar",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common and Celestial."
            },
            {
                "race_name": "Aasimar",
                "name": "Light Bearer",
                "source_name": "VGM",
                "text": "You know the {@spell light} cantrip. Charisma is your spellcasting ability for it."
            },
            {
                "race_name": "Aasimar",
                "name": "Darkvision",
                "source_name": "VGM",
                "text": "Blessed with a radiant soul, your vision can easily cut through darkness. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Aasimar",
                "name": "Age",
                "source_name": "VGM",
                "text": "Aasimar mature at the same rate as humans, but they can live up to 160 years."
            }
        ]
    },
    {
        "type": "race",
        "name": "Kobold",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "0",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Kobold",
                "name": "Grovel, Cower, and Beg",
                "source_name": "VGM",
                "text": "As an action on your turn, you can cower pathetically to distract nearby foes. Until the end of your next turn, your allies gain advantage on attack rolls against enemies within 10 feet of you that you can see. Once you use this trait, you can't use it again until you finish a short or long rest."
            },
            {
                "race_name": "Kobold",
                "name": "Pack Tactics",
                "source_name": "VGM",
                "text": "You have advantage on an attack roll against a creature if at least one of your allies is within 5 feet of the creature and the ally isn't {@condition incapacitated}."
            },
            {
                "race_name": "Kobold",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common and Draconic."
            },
            {
                "race_name": "Kobold",
                "name": "Size",
                "source_name": "VGM",
                "text": "Kobolds are between 2 and 3 feet tall and weigh between 25 and 35 pounds. Your size is Small."
            },
            {
                "race_name": "Kobold",
                "name": "Age",
                "source_name": "VGM",
                "text": "Kobolds reach adulthood at age 6 and can live up to 120 years but rarely do so."
            },
            {
                "race_name": "Kobold",
                "name": "Darkvision",
                "source_name": "VGM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Kobold",
                "name": "Sunlight Sensitivity",
                "source_name": "VGM",
                "text": "You have disadvantage on attack rolls and on Wisdom ({@skill Perception}) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
            }
        ]
    },
    {
        "type": "race",
        "name": "Dragonborn (Gem)",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "FTD",
        "RacialTraits": [
            {
                "race_name": "Dragonborn (Gem)",
                "name": "Psionic Mind",
                "source_name": "FTD",
                "text": "You can send telepathic messages to any creature you can see within 30 feet of you. You don't need to share a language with the creature for it to understand these messages, but it must be able to understand at least one language to comprehend them."
            },
            {
                "race_name": "Dragonborn (Gem)",
                "name": "Gem Ancestry",
                "source_name": "FTD",
                "text": "You have a gem dragon ancestor, granting you a special magical affinity. Choose one kind of dragon from the Gem Ancestry table. This determines the damage type for your other traits, as shown in the table.,[object Object]"
            },
            {
                "race_name": "Dragonborn (Gem)",
                "name": "Breath Weapon",
                "source_name": "FTD",
                "text": "When you take the {@action Attack} action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 15-foot cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes {@damage 1d10} damage of the type associated with your Gem Ancestry. On a successful save, it takes half as much damage. This damage increases by {@dice 1d10} when you reach 5th level ({@dice 2d10}), 11th level ({@dice 3d10}), and 17th level ({@dice 4d10}).,You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Dragonborn (Gem)",
                "name": "Gem Flight",
                "source_name": "FTD",
                "text": "Starting at 5th level, you can use a bonus action to manifest spectral wings on your body. These wings last for 1 minute. For the duration, you gain a flying speed equal to your walking speed and can hover. Once you use this trait, you can't do so again until you finish a long rest."
            },
            {
                "race_name": "Dragonborn (Gem)",
                "name": "Draconic Resistance",
                "source_name": "FTD",
                "text": "You have resistance to the damage type associated with your Gem Ancestry."
            }
        ]
    },
    {
        "type": "race",
        "name": "Verdan",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "2",
        "wis": "0",
        "source_name": "AI",
        "RacialTraits": [
            {
                "race_name": "Verdan",
                "name": "Size",
                "source_name": "AI",
                "text": "Verdan start out similar in size to the goblins they were created from, ranging from 3 to 4 feet in height. But at some point after reaching maturity, each verdan undergoes a sudden growth spurt of 2 feet or more. At 1st level, you are a Small creature. When you reach 5th level, you become a Medium creature."
            },
            {
                "race_name": "Verdan",
                "name": "Alignment",
                "source_name": "AI",
                "text": "Verdan are generally good, although their absence of racial identity and shared history can sometimes see individual verdan become untethered from any moral or ethical framework."
            },
            {
                "race_name": "Verdan",
                "name": "Language",
                "source_name": "AI",
                "text": "You speak, read, and write Common, Goblin, and one additional language of your choice. This language typically has some connection to one of the areas or cultures that has been part of your life."
            },
            {
                "race_name": "Verdan",
                "name": "Age",
                "source_name": "AI",
                "text": "Verdan reach adulthood at around the age of 24, and it is thought that they might live to nearly 200 years old. However, because no verdan has died of old age since the race's initial creation, their upper age limits remain subject to speculation."
            },
            {
                "race_name": "Verdan",
                "name": "Black Blood Healing",
                "source_name": "AI",
                "text": "The black blood that is a sign of your people's connection to That-Which-Endures boosts your natural healing. When you roll a 1 or 2 on any Hit Die you spend at the end of a short rest, you can reroll the die and must use the new roll."
            },
            {
                "race_name": "Verdan",
                "name": "Telepathic Insight",
                "source_name": "AI",
                "text": "Your mind's connection to the world around you strengthens your will. You have advantage on all Wisdom and Charisma saving throws."
            },
            {
                "race_name": "Verdan",
                "name": "Limited Telepathy",
                "source_name": "AI",
                "text": "You can telepathically speak to any creature you can see within 30 feet of you. You don't need to share a language with the creature for it to understand your telepathy, but it must be able to understand at least one language. This process of communication is slow and limited, allowing you to transmit and receive only simple ideas and straightforward concepts."
            },
            {
                "race_name": "Verdan",
                "name": "Persuasive",
                "source_name": "AI",
                "text": "Your people's lack of history makes you trustworthy and humble. You have proficiency in the {@skill Persuasion} skill."
            }
        ]
    },
    {
        "type": "race",
        "name": "Firbolg",
        "speed": "0",
        "str": "1",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "2",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Firbolg",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common, Elvish, and Giant."
            },
            {
                "race_name": "Firbolg",
                "name": "Hidden Step",
                "source_name": "VGM",
                "text": "As a bonus action, you can magically turn {@condition invisible} until the start of your next turn or until you attack, make a damage roll, or force someone to make a saving throw. Once you use this trait, you can't use it again until you finish a short or long rest."
            },
            {
                "race_name": "Firbolg",
                "name": "Age",
                "source_name": "VGM",
                "text": "As humanoids related to the fey, firbolg have long lifespans. A firbolg reaches adulthood around 30, and the oldest of them can live for 500 years."
            },
            {
                "race_name": "Firbolg",
                "name": "Firbolg Magic",
                "source_name": "VGM",
                "text": "You can cast {@spell detect magic} and {@spell disguise self} with this trait, using Wisdom as your spellcasting ability for them. Once you cast either spell, you can't cast it again with this trait until you finish a short or long rest. When you use this version of {@spell disguise self}, you can seem up to 3 feet shorter than normal, allowing you to more easily blend in with humans and elves."
            },
            {
                "race_name": "Firbolg",
                "name": "Size",
                "source_name": "VGM",
                "text": "Firbolg are between 7 and 8 feet tall and weigh between 240 and 300 pounds. Your size is Medium."
            },
            {
                "race_name": "Firbolg",
                "name": "Speech of Beast and Leaf",
                "source_name": "VGM",
                "text": "You have the ability to communicate in a limited manner with beasts and plants. They can understand the meaning of your words, though you have no special ability to understand them in return. You have advantage on all Charisma checks you make to influence them."
            },
            {
                "race_name": "Firbolg",
                "name": "Powerful Build",
                "source_name": "VGM",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
            }
        ]
    },
    {
        "type": "race",
        "name": "Orc",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Orc",
                "name": "Adrenaline Rush",
                "source_name": "MPMM",
                "text": "You can take the {@action Dash} action as a bonus action. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.,Whenever you use this trait, you gain a number of temporary hit points equal to your proficiency bonus."
            },
            {
                "race_name": "Orc",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Orc",
                "name": "Powerful Build",
                "source_name": "MPMM",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
            },
            {
                "race_name": "Orc",
                "name": "Relentless Endurance",
                "source_name": "MPMM",
                "text": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. Once you use this trait, you can't do so again until you finish a long rest."
            }
        ]
    },
    {
        "type": "race",
        "name": "Goblin",
        "speed": "0",
        "str": "-2",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Goblin",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Common and Goblin."
            },
            {
                "race_name": "Goblin",
                "name": "Darkvision",
                "source_name": "DMG",
                "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Goblin",
                "name": "Nimble Escape",
                "source_name": "DMG",
                "text": "You can take the {@action Disengage} or {@action Hide} action as a bonus action on each of your turns."
            }
        ]
    },
    {
        "type": "race",
        "name": "Yuan-ti Pureblood",
        "speed": "0",
        "str": "0",
        "int": "1",
        "cos": "0",
        "dex": "0",
        "cha": "2",
        "wis": "0",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Yuan-ti Pureblood",
                "name": "Size",
                "source_name": "VGM",
                "text": "Purebloods match humans in average size and weight. Your size is Medium."
            },
            {
                "race_name": "Yuan-ti Pureblood",
                "name": "Innate Spellcasting",
                "source_name": "VGM",
                "text": "You know the {@spell poison spray} cantrip. You can cast {@spell animal friendship} an unlimited number of times with this trait, but you can target only snakes with it. Starting at 3rd level, you can also cast {@spell suggestion} with this trait. Once you cast it, you can't do so again until you finish a long rest. Charisma is your spellcasting ability for these spells."
            },
            {
                "race_name": "Yuan-ti Pureblood",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common, Abyssal, and Draconic."
            },
            {
                "race_name": "Yuan-ti Pureblood",
                "name": "Poison Immunity",
                "source_name": "VGM",
                "text": "You are immune to poison damage and the {@condition poisoned} condition."
            },
            {
                "race_name": "Yuan-ti Pureblood",
                "name": "Darkvision",
                "source_name": "VGM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Yuan-ti Pureblood",
                "name": "Age",
                "source_name": "VGM",
                "text": "Purebloods mature at the same rate as humans and have lifespans similar in length to theirs."
            },
            {
                "race_name": "Yuan-ti Pureblood",
                "name": "Magic Resistance",
                "source_name": "VGM",
                "text": "You have advantage on saving throws against spells and other magical effects."
            }
        ]
    },
    {
        "type": "race",
        "name": "Minotaur",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Minotaur",
                "name": "Horns",
                "source_name": "MPMM",
                "text": "You have horns that you can use to make unarmed strikes. When you hit with them, the strike deals {@damage 1d6} + your Strength modifier piercing damage, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Minotaur",
                "name": "Hammering Horns",
                "source_name": "MPMM",
                "text": "Immediately after you hit a creature with a melee attack as part of the {@action Attack} action on your turn, you can use a bonus action to attempt to push that target with your horns. The target must be within 5 feet of you and no more than one size larger than you. Unless it succeeds on a Strength saving throw against a DC equal to 8 + your proficiency bonus + your Strength modifier, you can push it up to 10 feet away from you."
            },
            {
                "race_name": "Minotaur",
                "name": "Goring Rush",
                "source_name": "MPMM",
                "text": "Immediately after you take the {@action Dash} action on your turn and move at least 20 feet, you can make one melee attack with your Horns as a bonus action."
            },
            {
                "race_name": "Minotaur",
                "name": "Labyrinthine Recall",
                "source_name": "MPMM",
                "text": "You always know which direction is north, and you have advantage on any Wisdom ({@skill Survival}) check you make to navigate or track."
            }
        ]
    },
    {
        "type": "race",
        "name": "Changeling",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "2",
        "wis": "0",
        "source_name": "ERLW",
        "RacialTraits": [
            {
                "race_name": "Changeling",
                "name": "Languages",
                "source_name": "ERLW",
                "text": "You can speak, read, and write Common and two other languages of your choice."
            },
            {
                "race_name": "Changeling",
                "name": "Changeling Instincts",
                "source_name": "ERLW",
                "text": "You gain proficiency with two of the following skills of your choice: {@skill Deception}, {@skill Insight}, {@skill Intimidation}, and {@skill Persuasion}."
            },
            {
                "race_name": "Changeling",
                "name": "Shapechanger",
                "source_name": "ERLW",
                "text": "As an action, you can change your appearance and your voice. You determine the specifics of the changes, including your coloration, hair length, and sex. You can also adjust your height and weight, but not so much that your size changes. You can make yourself appear as a member of another race, though none of your game statistics change. You can't duplicate the appearance of a creature you've never seen, and you must adopt a form that has the same basic arrangement of limbs that you have. Your clothing and equipment aren't changed by this trait.,You stay in the new form until you use an action to revert to your true form or until you die."
            },
            {
                "race_name": "Changeling",
                "name": "Age",
                "source_name": "ERLW",
                "text": "Changelings mature slightly faster than humans but share a similar lifespan—typically a century or less. While a changeling can transform to conceal their age, the effects of aging affect them similarly to humans."
            },
            {
                "race_name": "Changeling",
                "name": "Alignment",
                "source_name": "ERLW",
                "text": "Changelings tend toward pragmatic neutrality, and few changelings embrace evil."
            },
            {
                "race_name": "Changeling",
                "name": "Size",
                "source_name": "ERLW",
                "text": "Your size is Medium."
            }
        ]
    },
    {
        "type": "race",
        "name": "Lizardfolk",
        "speed": "30",
        "str": "2",
        "int": "-2",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Lizardfolk",
                "name": "Natural Armor",
                "source_name": "DMG",
                "text": "Your scales function as natural armor, granting you a +3 bonus to Armor Class."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Draconic."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Hold Breath",
                "source_name": "DMG",
                "text": "You can hold your breath for up to 15 minutes at a time."
            }
        ]
    },
    {
        "type": "race",
        "name": "Aarakocra",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Aarakocra",
                "name": "Flight",
                "source_name": "MPMM",
                "text": "Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor."
            },
            {
                "race_name": "Aarakocra",
                "name": "Talons",
                "source_name": "MPMM",
                "text": "You have talons that you can use to make unarmed strikes. When you hit with them, the strike deals {@damage 1d6} + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Aarakocra",
                "name": "Wind Caller",
                "source_name": "MPMM",
                "text": "Starting at 3rd level, you can cast the {@spell gust of wind} spell with this trait, without requiring a material component. Once you cast the spell with this trait, you can't do so again until you finish a long rest. You can also cast the spell using any spell slots you have of 2nd level or higher.,Intelligence, Wisdom, or Charisma is your spellcasting ability for when you cast {@spell gust of wind} with this trait (choose when you select this race)."
            }
        ]
    },
    {
        "type": "race",
        "name": "Kenku",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Kenku",
                "name": "Mimicry",
                "source_name": "MPMM",
                "text": "You can accurately mimic sounds you have heard, including voices. A creature that hears the sounds you make can tell they are imitations only with a successful Wisdom ({@skill Insight}) check against a DC of 8 + your proficiency bonus + your Charisma modifier."
            },
            {
                "race_name": "Kenku",
                "name": "Kenku Recall",
                "source_name": "MPMM",
                "text": "Thanks to your supernaturally good memory, you have proficiency in two skills of your choice.,Moreover, when you make an ability check using any skill in which you have proficiency, you can give yourself advantage on the check before rolling the {@dice d20}. You can give yourself advantage in this way a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Kenku",
                "name": "Size",
                "source_name": "MPMM",
                "text": "Your size is Medium or Small. You choose the size when you select this race."
            },
            {
                "race_name": "Kenku",
                "name": "Expert Duplication",
                "source_name": "MPMM",
                "text": "When you copy writing or craftwork produced by yourself or someone else, you have advantage on any ability checks you make to produce an exact duplicate."
            }
        ]
    },
    {
        "type": "race",
        "name": "Dragonborn (Chromatic)",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "FTD",
        "RacialTraits": [
            {
                "race_name": "Dragonborn (Chromatic)",
                "name": "Breath Weapon",
                "source_name": "FTD",
                "text": "When you take the {@action Attack} action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 30-foot line that is 5 feet wide. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes {@damage 1d10} damage of the type associated with your Chromatic Ancestry. On a successful save, it takes half as much damage. This damage increases by {@dice 1d10} when you reach 5th level ({@dice 2d10}), 11th level ({@dice 3d10}), and 17th level ({@dice 4d10}).,You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Dragonborn (Chromatic)",
                "name": "Chromatic Ancestry",
                "source_name": "FTD",
                "text": "You have a chromatic dragon ancestor, granting you a special magical affinity. Choose one kind of dragon from the Chromatic Ancestry table. This determines the damage type for your other traits, as shown in the table.,[object Object]"
            },
            {
                "race_name": "Dragonborn (Chromatic)",
                "name": "Draconic Resistance",
                "source_name": "FTD",
                "text": "You have resistance to the damage type associated with your Chromatic Ancestry."
            },
            {
                "race_name": "Dragonborn (Chromatic)",
                "name": "Chromatic Warding",
                "source_name": "FTD",
                "text": "Starting at 5th level, as an action, you can channel your draconic energy to protect yourself. For 1 minute, you become immune to the damage type associated with your Chromatic Ancestry. Once you use this trait, you can't do so again until you finish a long rest."
            }
        ]
    },
    {
        "type": "race",
        "name": "Fairy",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Fairy",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Fey."
            },
            {
                "race_name": "Fairy",
                "name": "Flight",
                "source_name": "MPMM",
                "text": "Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor."
            },
            {
                "race_name": "Fairy",
                "name": "Fairy Magic",
                "source_name": "MPMM",
                "text": "You know the {@spell druidcraft} cantrip. Starting at 3rd level, you can cast the {@spell faerie fire} spell with this trait. Starting at 5th level, you can also cast the {@spell enlarge/reduce} spell with this trait. Once you cast {@spell faerie fire} or {@spell enlarge/reduce} with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.,Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
            }
        ]
    },
    {
        "type": "race",
        "name": "Elf",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "0",
        "source_name": "PHB",
        "RacialTraits": [
            {
                "race_name": "Elf",
                "name": "Darkvision",
                "source_name": "PHB",
                "text": "Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Elf",
                "name": "Fey Ancestry",
                "source_name": "PHB",
                "text": "You have advantage on saving throws against being {@condition charmed}, and magic can't put you to sleep."
            },
            {
                "race_name": "Elf",
                "name": "Languages",
                "source_name": "PHB",
                "text": "You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
            },
            {
                "race_name": "Elf",
                "name": "Age",
                "source_name": "PHB",
                "text": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old."
            },
            {
                "race_name": "Elf",
                "name": "Size",
                "source_name": "PHB",
                "text": "Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium."
            },
            {
                "race_name": "Elf",
                "name": "Trance",
                "source_name": "PHB",
                "text": "Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.,{@note If you meditate during a long rest, you finish the rest after only 4 hours. You otherwise obey all the rules for a long rest; only the duration is changed.}"
            },
            {
                "race_name": "Elf",
                "name": "Keen Senses",
                "source_name": "PHB",
                "text": "You have proficiency in the {@skill Perception} skill."
            }
        ]
    },
    {
        "type": "race",
        "name": "Eladrin",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Eladrin",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Humanoid. You are also considered an elf for any prerequisite or effect that requires you to be an elf."
            },
            {
                "race_name": "Eladrin",
                "name": "Fey Step",
                "source_name": "MPMM",
                "text": "As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.,When you reach 3rd level, your Fey Step gain an additional effect based on your season; if the effect requires a saving throw, the DC equals 8 + your proficiency bonus + your Intelligence, Wisdom, or Charisma modifier (choose when you select this race):,[object Object]"
            },
            {
                "race_name": "Eladrin",
                "name": "Fey Ancestry",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws you make to avoid or end the {@condition charmed} condition on yourself."
            },
            {
                "race_name": "Eladrin",
                "name": "Trance",
                "source_name": "MPMM",
                "text": "You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness.,Whenever you finish this trance, you can change your season, and you can gain two proficiencies that you don't have, each one with a weapon or a tool of your choice selected from the Player's Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory, and you retain them until you finish your next long rest."
            },
            {
                "race_name": "Eladrin",
                "name": "Keen Senses",
                "source_name": "MPMM",
                "text": "You have proficiency in the {@skill Perception} skill."
            },
            {
                "race_name": "Eladrin",
                "name": "Note",
                "source_name": "MPMM",
                "text": ""
            },
            {
                "race_name": "Eladrin",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Half-Orc",
        "speed": "0",
        "str": "2",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "PHB",
        "RacialTraits": [
            {
                "race_name": "Half-Orc",
                "name": "Darkvision",
                "source_name": "PHB",
                "text": "Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Half-Orc",
                "name": "Relentless Endurance",
                "source_name": "PHB",
                "text": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest."
            },
            {
                "race_name": "Half-Orc",
                "name": "Age",
                "source_name": "PHB",
                "text": "Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years."
            },
            {
                "race_name": "Half-Orc",
                "name": "Languages",
                "source_name": "PHB",
                "text": "You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script."
            },
            {
                "race_name": "Half-Orc",
                "name": "Size",
                "source_name": "PHB",
                "text": "Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium."
            },
            {
                "race_name": "Half-Orc",
                "name": "Menacing",
                "source_name": "PHB",
                "text": "You gain proficiency in the {@skill Intimidation} skill."
            },
            {
                "race_name": "Half-Orc",
                "name": "Savage Attacks",
                "source_name": "PHB",
                "text": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."
            }
        ]
    },
    {
        "type": "race",
        "name": "Kalashtar",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "1",
        "wis": "2",
        "source_name": "ERLW",
        "RacialTraits": [
            {
                "race_name": "Kalashtar",
                "name": "Mind Link",
                "source_name": "ERLW",
                "text": "You can speak telepathically to any creature you can see, provided the creature is within a number of feet of you equal to 10 times your level. You don't need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language.,When you're using this trait to speak telepathically to a creature, you can use your action to give that creature the ability to speak telepathically with you for 1 hour or until you end this effect as an action. To use this ability, the creature must be able to see you and must be within this trait's range. You can give this ability to only one creature at a time; giving it to a creature takes it away from another creature who has it."
            },
            {
                "race_name": "Kalashtar",
                "name": "Dual Mind",
                "source_name": "ERLW",
                "text": "You have advantage on all Wisdom saving throws."
            },
            {
                "race_name": "Kalashtar",
                "name": "Alignment",
                "source_name": "ERLW",
                "text": "The noble spirit tied to a kalashtar drives it toward lawful and good behavior. Most kalashtar combine strong self-discipline with compassion for all beings, but some kalashtar resist the virtuous influence of their spirit."
            },
            {
                "race_name": "Kalashtar",
                "name": "Severed from Dreams",
                "source_name": "ERLW",
                "text": "Kalashtar sleep, but they don't connect to the plane of dreams as other creatures do. Instead, their minds draw from the memories of their otherworldly spirit while they sleep. As such, you are immune to spells and other magical effects that require you to dream, like {@spell dream}, but not to spells and other magical effects that put you to sleep, like {@spell sleep}."
            },
            {
                "race_name": "Kalashtar",
                "name": "Languages",
                "source_name": "ERLW",
                "text": "You can speak, read, and write Common, Quori, and one other language of your choice."
            },
            {
                "race_name": "Kalashtar",
                "name": "Size",
                "source_name": "ERLW",
                "text": "Your size is Medium."
            },
            {
                "race_name": "Kalashtar",
                "name": "Age",
                "source_name": "ERLW",
                "text": "Kalashtar mature and age at the same rate as humans."
            },
            {
                "race_name": "Kalashtar",
                "name": "Mental Discipline",
                "source_name": "ERLW",
                "text": "You have resistance to psychic damage."
            }
        ]
    },
    {
        "type": "race",
        "name": "Bugbear",
        "speed": "0",
        "str": "2",
        "int": "0",
        "cos": "0",
        "dex": "1",
        "cha": "0",
        "wis": "0",
        "source_name": "ERLW",
        "RacialTraits": [
            {
                "race_name": "Bugbear",
                "name": "Alignment",
                "source_name": "ERLW",
                "text": "Bugbears live on the fringes of society even in Darguun, where they value self-sufficiency and violence. They are generally chaotic, organizing in loose tribes under charismatic and powerful leaders."
            },
            {
                "race_name": "Bugbear",
                "name": "Long-Limbed",
                "source_name": "ERLW",
                "text": "When you make a melee attack on your turn, your reach for it is 5 feet greater than normal."
            },
            {
                "race_name": "Bugbear",
                "name": "Sneaky",
                "source_name": "ERLW",
                "text": "You are proficient in the {@skill Stealth} skill."
            },
            {
                "race_name": "Bugbear",
                "name": "Size",
                "source_name": "ERLW",
                "text": "Your size is Medium."
            },
            {
                "race_name": "Bugbear",
                "name": "Surprise Attack",
                "source_name": "ERLW",
                "text": "If you surprise a creature and hit it with an attack on your first turn in combat, the attack deals an extra {@dice 2d6} damage to it. You can use this trait only once per combat."
            },
            {
                "race_name": "Bugbear",
                "name": "Languages",
                "source_name": "ERLW",
                "text": "You can speak, read, and write Common and Goblin."
            },
            {
                "race_name": "Bugbear",
                "name": "Age",
                "source_name": "ERLW",
                "text": "Bugbears reach adulthood at age 16 and live up to 80 years."
            },
            {
                "race_name": "Bugbear",
                "name": "Powerful Build",
                "source_name": "ERLW",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
            },
            {
                "race_name": "Bugbear",
                "name": "Darkvision",
                "source_name": "ERLW",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Bullywug",
        "speed": "20",
        "str": "0",
        "int": "-2",
        "cos": "0",
        "dex": "0",
        "cha": "-2",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Bullywug",
                "name": "Standing Leap",
                "source_name": "DMG",
                "text": "Your long jump is up to 20 feet and your high jump is up to 10 feet, with or without a running start."
            },
            {
                "race_name": "Bullywug",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Bullywug."
            },
            {
                "race_name": "Bullywug",
                "name": "Speak with Frogs and Toads",
                "source_name": "DMG",
                "text": "You can communicate simple concepts to frogs and toads when you speak in Bullywug."
            },
            {
                "race_name": "Bullywug",
                "name": "Amphibious",
                "source_name": "DMG",
                "text": "You can breathe air and water."
            },
            {
                "race_name": "Bullywug",
                "name": "Swamp Camouflage",
                "source_name": "DMG",
                "text": "You have advantage on Dexterity ({@skill Stealth}) checks made to hide in swampy terrain."
            }
        ]
    },
    {
        "type": "race",
        "name": "Dragonborn",
        "speed": "0",
        "str": "2",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "1",
        "wis": "0",
        "source_name": "PHB",
        "RacialTraits": [
            {
                "race_name": "Dragonborn",
                "name": "Languages",
                "source_name": "PHB",
                "text": "You can speak, read, and write Common and Draconic. Draconic is thought to be one of the oldest languages and is often used in the study of magic. The language sounds harsh to most other creatures and includes numerous hard consonants and sibilants."
            },
            {
                "race_name": "Dragonborn",
                "name": "Damage Resistance",
                "source_name": "PHB",
                "text": "You have resistance to the damage type associated with your draconic ancestry."
            },
            {
                "race_name": "Dragonborn",
                "name": "Breath Weapon",
                "source_name": "PHB",
                "text": "You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.,When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes {@dice 2d6} damage on a failed save, and half as much damage on a successful one. The damage increases to {@dice 3d6} at 6th level, {@dice 4d6} at 11th level, and {@dice 5d6} at 16th level.,After you use your breath weapon, you can't use it again until you complete a short or long rest."
            },
            {
                "race_name": "Dragonborn",
                "name": "Size",
                "source_name": "PHB",
                "text": "Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium."
            },
            {
                "race_name": "Dragonborn",
                "name": "Draconic Ancestry",
                "source_name": "PHB",
                "text": "You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.,[object Object]"
            },
            {
                "race_name": "Dragonborn",
                "name": "Age",
                "source_name": "PHB",
                "text": "Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80."
            }
        ]
    },
    {
        "type": "race",
        "name": "Triton",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Triton",
                "name": "Guardian of the Depths",
                "source_name": "MPMM",
                "text": "Adapted to the frigid ocean depths, you have resistance to cold damage."
            },
            {
                "race_name": "Triton",
                "name": "Control Air and Water",
                "source_name": "MPMM",
                "text": "You can cast {@spell fog cloud} with this trait. Starting at 3rd level, you can cast the {@spell gust of wind} spell with this trait. Starting at 5th level, you can also cast the {@spell water walk} spell with it. Once you cast any of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using any spell slots you have of the appropriate level.,Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
            },
            {
                "race_name": "Triton",
                "name": "Amphibious",
                "source_name": "MPMM",
                "text": "You can breathe air and water."
            },
            {
                "race_name": "Triton",
                "name": "Speed",
                "source_name": "MPMM",
                "text": "Your walking speed is 30 feet, and you have a swimming speed equal to your walking speed."
            },
            {
                "race_name": "Triton",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Triton",
                "name": "Emissary of the Sea",
                "source_name": "MPMM",
                "text": "You can communicate simple ideas to any Beast, Elemental, or Monstrosity that has a swimming speed. It can understand your words, though you have no special ability to understand it in return."
            }
        ]
    },
    {
        "type": "race",
        "name": "Tabaxi",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "1",
        "wis": "0",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Tabaxi",
                "name": "Age",
                "source_name": "VGM",
                "text": "Tabaxi have lifespans equivalent to humans."
            },
            {
                "race_name": "Tabaxi",
                "name": "Cat's Talents",
                "source_name": "VGM",
                "text": "You have proficiency in the {@skill Perception} and {@skill Stealth} skills."
            },
            {
                "race_name": "Tabaxi",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common and one other language of your choice."
            },
            {
                "race_name": "Tabaxi",
                "name": "Cat's Claws",
                "source_name": "VGM",
                "text": "Because of your claws, you have a climbing speed of 20 feet. In addition, your claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to {@damage 1d4} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Tabaxi",
                "name": "Darkvision",
                "source_name": "VGM",
                "text": "You have a cat's keen senses, especially in the dark. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Tabaxi",
                "name": "Feline Agility",
                "source_name": "VGM",
                "text": "Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."
            },
            {
                "race_name": "Tabaxi",
                "name": "Size",
                "source_name": "VGM",
                "text": "Tabaxi are taller on average than humans and relatively slender. Your size is Medium."
            }
        ]
    },
    {
        "type": "race",
        "name": "Hobgoblin",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Hobgoblin",
                "name": "Martial Advantage",
                "source_name": "DMG",
                "text": "Once per turn, you can deal an extra {@dice 2d6} damage to a creature you hit with a weapon attack if that creature is within 5 ft. of an ally of yours that isn't {@condition incapacitated}."
            },
            {
                "race_name": "Hobgoblin",
                "name": "Darkvision",
                "source_name": "DMG",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Hobgoblin",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Common and Goblin."
            }
        ]
    },
    {
        "type": "race",
        "name": "Triton",
        "speed": "30",
        "str": "1",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "1",
        "wis": "0",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Triton",
                "name": "Control Air and Water",
                "source_name": "VGM",
                "text": "A child of the sea, you can call on the magic of elemental air and water. You can cast {@spell fog cloud} with this trait. Starting at 3rd level, you can cast {@spell gust of wind} with it, and starting at 5th level, you can also cast {@spell wall of water|xge} with it. Once you cast a spell with this trait, you can't cast that spell with it again until you finish a long rest. Charisma is your spellcasting ability for these spells."
            },
            {
                "race_name": "Triton",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common and Primordial."
            },
            {
                "race_name": "Triton",
                "name": "Guardians of the Depths",
                "source_name": "VGM",
                "text": "Adapted to even the most extreme ocean depths, you have resistance to cold damage."
            },
            {
                "race_name": "Triton",
                "name": "Age",
                "source_name": "VGM",
                "text": "Tritons reach maturity around age 15 and can live up to 200 years."
            },
            {
                "race_name": "Triton",
                "name": "Amphibious",
                "source_name": "VGM",
                "text": "You can breathe air and water."
            },
            {
                "race_name": "Triton",
                "name": "Darkvision",
                "source_name": "VGM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Triton",
                "name": "Size",
                "source_name": "VGM",
                "text": "Tritons are slightly shorter than humans, averaging about 5 feet tall. Your size is Medium."
            },
            {
                "race_name": "Triton",
                "name": "Emissary of the Sea",
                "source_name": "VGM",
                "text": "Aquatic beasts have an extraordinary affinity with your people. You can communicate simple ideas with beasts that can breathe water. They can understand the meaning of your words, though you have no special ability to understand them in return."
            },
            {
                "race_name": "Triton",
                "name": "Swim Speed",
                "source_name": "VGM",
                "text": "You have a swimming speed of 30 feet."
            }
        ]
    },
    {
        "type": "race",
        "name": "Bugbear",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Bugbear",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Humanoid. You are also considered a goblinoid for any prerequisite or effect that requires you to be a goblinoid."
            },
            {
                "race_name": "Bugbear",
                "name": "Fey Ancestry",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws you make to avoid or end the {@condition charmed} condition on yourself."
            },
            {
                "race_name": "Bugbear",
                "name": "Sneaky",
                "source_name": "MPMM",
                "text": "You are proficient in the {@skill Stealth} skill. In addition, without squeezing, you can move through and stop in a space large enough for a Small creature."
            },
            {
                "race_name": "Bugbear",
                "name": "Surprise Attack",
                "source_name": "MPMM",
                "text": "If you hit a creature with an attack roll, the creature takes an extra {@damage 2d6} damage if it hasn't taken a turn yet in the current combat."
            },
            {
                "race_name": "Bugbear",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Bugbear",
                "name": "Powerful Build",
                "source_name": "MPMM",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
            },
            {
                "race_name": "Bugbear",
                "name": "Long-Limbed",
                "source_name": "MPMM",
                "text": "When you make a melee attack on your turn, your reach for it is 5 feet greater than normal."
            }
        ]
    },
    {
        "type": "race",
        "name": "Centaur",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Centaur",
                "name": "Equine Build",
                "source_name": "MPMM",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push or drag.,In addition, any climb that requires hands and feet is especially difficult for you because of your equine legs. When you make such a climb, each foot of movement costs you 4 extra feet instead of the normal 1 extra foot."
            },
            {
                "race_name": "Centaur",
                "name": "Hooves",
                "source_name": "MPMM",
                "text": "You have hooves that you can use to make unarmed strikes. When you hit with them, the strike deals {@damage 1d6} + your Strength modifier bludgeoning damage, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Centaur",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Fey."
            },
            {
                "race_name": "Centaur",
                "name": "Natural Affinity",
                "source_name": "MPMM",
                "text": "Your fey connection to nature gives you an intuitive connection to the natural world and the animals within it. You therefore have proficiency in one of the following skills of your choice: {@skill Animal Handling}, {@skill Medicine}, {@skill Nature}, or {@skill Survival}."
            },
            {
                "race_name": "Centaur",
                "name": "Charge",
                "source_name": "MPMM",
                "text": "If you move at least 30 feet straight toward a target and then hit it with a melee weapon attack on the same turn, you can immediately follow that attack with a bonus action, making one attack against the target with your hooves."
            }
        ]
    },
    {
        "type": "race",
        "name": "Tiefling",
        "speed": "0",
        "str": "0",
        "int": "1",
        "cos": "0",
        "dex": "0",
        "cha": "2",
        "wis": "0",
        "source_name": "PHB",
        "RacialTraits": [
            {
                "race_name": "Tiefling",
                "name": "Age",
                "source_name": "PHB",
                "text": "Tieflings mature at the same rate as humans but live a few years longer."
            },
            {
                "race_name": "Tiefling",
                "name": "Languages",
                "source_name": "PHB",
                "text": "You can speak, read, and write Common and Infernal."
            },
            {
                "race_name": "Tiefling",
                "name": "Size",
                "source_name": "PHB",
                "text": "Tieflings are about the same size and build as humans. Your size is Medium."
            },
            {
                "race_name": "Tiefling",
                "name": "Darkvision",
                "source_name": "PHB",
                "text": "Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Tiefling",
                "name": "Hellish Resistance",
                "source_name": "PHB",
                "text": "You have resistance to fire damage."
            },
            {
                "race_name": "Tiefling",
                "name": "Infernal Legacy",
                "source_name": "PHB",
                "text": "You know the {@spell thaumaturgy} cantrip. Once you reach 3rd level, you can cast the {@spell hellish rebuke} spell as a 2nd-level spell with this trait; you regain the ability to cast it when you finish a long rest. Once you reach 5th level, you can also cast the {@spell darkness} spell once per day with this trait; you regain the ability to cast it when you finish a long rest. Charisma is your spellcasting ability for these spells."
            }
        ]
    },
    {
        "type": "race",
        "name": "Custom Lineage",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "TCE",
        "RacialTraits": [
            {
                "race_name": "Custom Lineage",
                "name": "Size",
                "source_name": "TCE",
                "text": "You are Small or Medium (your choice)."
            },
            {
                "race_name": "Custom Lineage",
                "name": "Variable Trait",
                "source_name": "TCE",
                "text": "You gain one of the following options of your choice: (a) {@sense darkvision} with a range of 60 feet or (b) proficiency in one skill of your choice."
            },
            {
                "race_name": "Custom Lineage",
                "name": "Note",
                "source_name": "TCE",
                "text": ""
            },
            {
                "race_name": "Custom Lineage",
                "name": "Note",
                "source_name": "TCE",
                "text": ""
            },
            {
                "race_name": "Custom Lineage",
                "name": "Creature Type",
                "source_name": "TCE",
                "text": "You are a humanoid. You determine your appearance and whether you resemble any of your kin."
            },
            {
                "race_name": "Custom Lineage",
                "name": "Languages",
                "source_name": "TCE",
                "text": "You can speak, read, and write Common and one other language that you and your DM agree is appropriate for your character."
            },
            {
                "race_name": "Custom Lineage",
                "name": "Feat",
                "source_name": "TCE",
                "text": "You gain one {@5etools feat|feats.html} of your choice for which you qualify."
            }
        ]
    },
    {
        "type": "race",
        "name": "Leonin",
        "speed": "0",
        "str": "1",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MOT",
        "RacialTraits": [
            {
                "race_name": "Leonin",
                "name": "Darkvision",
                "source_name": "MOT",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Leonin",
                "name": "Size",
                "source_name": "MOT",
                "text": "Leonin are typically over 6 feet tall, with some standing over 7 feet. Your size is Medium."
            },
            {
                "race_name": "Leonin",
                "name": "Age",
                "source_name": "MOT",
                "text": "Leonin mature and age at about the same rate as humans."
            },
            {
                "race_name": "Leonin",
                "name": "Claws",
                "source_name": "MOT",
                "text": "Your claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you can deal slashing damage equal to {@damage 1d4} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Leonin",
                "name": "Daunting Roar",
                "source_name": "MOT",
                "text": "As a bonus action, you can let out an especially menacing roar. Creatures of your choice within 10 feet of you that can hear you must succeed on a Wisdom saving throw or become {@condition frightened} of you until the end of your next turn. The DC of the save equals 8 + your proficiency bonus + your Constitution modifier. Once you use this trait, you can't use it again until you finish a short or long rest."
            },
            {
                "race_name": "Leonin",
                "name": "Alignment",
                "source_name": "MOT",
                "text": "Leonin tend toward good alignments. Leonin who are focused on the pride lean toward lawful good."
            },
            {
                "race_name": "Leonin",
                "name": "Hunter's Instincts",
                "source_name": "MOT",
                "text": "You have proficiency in one of the following skills of your choice: {@skill Athletics}, {@skill Intimidation}, {@skill Perception}, or {@skill Survival}."
            },
            {
                "race_name": "Leonin",
                "name": "Languages",
                "source_name": "MOT",
                "text": "You can speak, read, and write Common and Leonin."
            }
        ]
    },
    {
        "type": "race",
        "name": "Tortle",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Tortle",
                "name": "Shell Defense",
                "source_name": "MPMM",
                "text": "You can withdraw into your shell as an action. Until you emerge, you gain a +4 bonus to your AC, and you have advantage on Strength and Constitution saving throws. While in your shell, you are {@condition prone}, your speed is 0 and can't increase, you have disadvantage on Dexterity saving throws, you can't take reactions, and the only action you can take is a bonus action to emerge from your shell."
            },
            {
                "race_name": "Tortle",
                "name": "Claws",
                "source_name": "MPMM",
                "text": "You have claws that you can use to make unarmed strikes. When you hit with them, the strike deals {@damage 1d6} + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Tortle",
                "name": "Nature's Intuition",
                "source_name": "MPMM",
                "text": "Thanks to your mystical connection to nature, you gain proficiency with one of the following skills of your choice: {@skill Animal Handling}, {@skill Medicine}, {@skill Nature}, {@skill Perception}, {@skill Stealth}, or {@skill Survival}."
            },
            {
                "race_name": "Tortle",
                "name": "Hold Breath",
                "source_name": "MPMM",
                "text": "You can hold your breath for up to 1 hour."
            },
            {
                "race_name": "Tortle",
                "name": "Size",
                "source_name": "MPMM",
                "text": "You are Medium or Small. You choose the size when you select this race."
            },
            {
                "race_name": "Tortle",
                "name": "Natural Armor",
                "source_name": "MPMM",
                "text": "Your shell provides you a base AC of 17 (your Dexterity modifier doesn't affect this number). You can't wear light, medium, or heavy armor, but if you are using a shield, you can apply the shield's bonus as normal."
            }
        ]
    },
    {
        "type": "race",
        "name": "Lizardfolk",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "1",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Lizardfolk",
                "name": "Natural Armor",
                "source_name": "VGM",
                "text": "You have tough, scaly skin. When you aren't wearing armor, your AC is 13 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Cunning Artisan",
                "source_name": "VGM",
                "text": "As part of a short rest, you can harvest bone and hide from a slain beast, construct, dragon, monstrosity, or plant creature of size small or larger to create one of the following items: a {@item shield|phb}, a {@item club|phb}, a {@item javelin|phb}, or {@dice 1d4} {@item dart|phb|darts} or {@item blowgun needle|phb|blowgun needles}. To use this trait, you need a blade, such as a {@item dagger|phb}, or appropriate {@filter artisan's tools|items|source=phb|miscellaneous=mundane|type=artisan's tools}, such as {@item leatherworker's tools|phb}."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Swim Speed",
                "source_name": "VGM",
                "text": "You have a swimming speed of 30 feet."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Size",
                "source_name": "VGM",
                "text": "Lizardfolk are a little bulkier and taller than humans, and their colorful frills make them appear even larger. Your size is Medium."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Bite",
                "source_name": "VGM",
                "text": "Your fanged maw is a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to {@dice 1d6} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Hold Breath",
                "source_name": "VGM",
                "text": "You can hold your breath for up to 15 minutes at a time."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Hunter's Lore",
                "source_name": "VGM",
                "text": "You gain proficiency with two of the following skills of your choice: {@skill Animal Handling}, {@skill Nature}, {@skill Perception}, {@skill Stealth}, and {@skill Survival}."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Hungry Jaws",
                "source_name": "VGM",
                "text": "In battle, you can throw yourself into a vicious feeding frenzy. As a bonus action, you can make a special attack with your bite. If the attack hits, it deals its normal damage, and you gain temporary hit points equal to your Constitution modifier (minimum of 1), and you can't use this trait again until you finish a short or long rest."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common and Draconic."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Age",
                "source_name": "VGM",
                "text": "Lizardfolk reach maturity around age 14 and rarely live longer than 60 years."
            }
        ]
    },
    {
        "type": "race",
        "name": "Sea Elf",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Sea Elf",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Sea Elf",
                "name": "Friend of the Sea",
                "source_name": "MPMM",
                "text": "Aquatic animals have an extraordinary affinity with your people. You can communicate simple ideas to any Beast that has a swimming speed. It can understand your words, though you have no special ability to understand it in return."
            },
            {
                "race_name": "Sea Elf",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Humanoid. You are also considered an elf for any prerequisite or effect that requires you to be an elf."
            },
            {
                "race_name": "Sea Elf",
                "name": "Speed",
                "source_name": "MPMM",
                "text": "Your walking speed is 30 feet, and you have a swimming speed equal to your walking speed."
            },
            {
                "race_name": "Sea Elf",
                "name": "Fey Ancestry",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws you make to avoid or end the {@condition charmed} condition on yourself."
            },
            {
                "race_name": "Sea Elf",
                "name": "Child of the Sea",
                "source_name": "MPMM",
                "text": "You can breathe air and water, and you have a resistance to cold damage."
            },
            {
                "race_name": "Sea Elf",
                "name": "Trance",
                "source_name": "MPMM",
                "text": "You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness.,Whenever you finish this trance, you can gain two proficiencies that you don't have, each one with a weapon or a tool of your choice selected from the Player's Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory, and you retain them until you finish your next long rest."
            },
            {
                "race_name": "Sea Elf",
                "name": "Keen Senses",
                "source_name": "MPMM",
                "text": "You have proficiency in the {@skill Perception} skill."
            }
        ]
    },
    {
        "type": "race",
        "name": "Hexblood",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "VRGR",
        "RacialTraits": [
            {
                "race_name": "Hexblood",
                "name": "Hex Magic",
                "source_name": "VRGR",
                "text": "You can cast the {@spell disguise self} and {@spell hex} spells with this trait. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using any spell slots you have.,Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose the ability when you gain this lineage).,[object Object]"
            },
            {
                "race_name": "Hexblood",
                "name": "Size",
                "source_name": "VRGR",
                "text": "You are Medium or Small. You choose the size when you gain this lineage."
            },
            {
                "race_name": "Hexblood",
                "name": "Ancestral Legacy",
                "source_name": "VRGR",
                "text": "If you replace a race with this lineage, you can keep the following elements of that race: any skill proficiencies you gained from it and any climbing, flying, or swimming speed you gained from it.,If you don't keep any of those elements or you choose this lineage at character creation, you gain proficiency in two skills of your choice."
            },
            {
                "race_name": "Hexblood",
                "name": "Creature Type",
                "source_name": "VRGR",
                "text": "You are a Fey."
            },
            {
                "race_name": "Hexblood",
                "name": "Darkvision",
                "source_name": "VRGR",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness as shades of gray."
            },
            {
                "race_name": "Hexblood",
                "name": "Eerie Token",
                "source_name": "VRGR",
                "text": "As a bonus action, you can harmlessly remove a lock of your hair, one of your nails, or one of your teeth. This token is imbued with magic until you finish a long rest. While the token is imbued in this way, you can take these actions:,[object Object],Once you create a token using this feature, you can't do so again until you finish a long rest, at which point your missing part regrows."
            }
        ]
    },
    {
        "type": "race",
        "name": "Human",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "PHB",
        "RacialTraits": [
            {
                "race_name": "Human",
                "name": "Size",
                "source_name": "PHB",
                "text": "Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
            },
            {
                "race_name": "Human",
                "name": "Languages",
                "source_name": "PHB",
                "text": "You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
            },
            {
                "race_name": "Human",
                "name": "Age",
                "source_name": "PHB",
                "text": "Humans reach adulthood in their late teens and live less than a century."
            }
        ]
    },
    {
        "type": "race",
        "name": "Hobgoblin",
        "speed": "0",
        "str": "0",
        "int": "1",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Hobgoblin",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common and Goblin."
            },
            {
                "race_name": "Hobgoblin",
                "name": "Martial Training",
                "source_name": "VGM",
                "text": "You are proficient with two {@filter martial weapons|items|source=phb|category=basic|type=martial weapon} of your choice and with light armor."
            },
            {
                "race_name": "Hobgoblin",
                "name": "Darkvision",
                "source_name": "VGM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Hobgoblin",
                "name": "Age",
                "source_name": "VGM",
                "text": "Hobgoblins mature at the same rate as humans and have lifespans similar in length to theirs."
            },
            {
                "race_name": "Hobgoblin",
                "name": "Saving Face",
                "source_name": "VGM",
                "text": "Hobgoblins are careful not to show weakness in front of their allies, for fear of losing status. If you miss with an attack roll or fail an ability check or a saving throw, you can gain a bonus to the roll equal to the number of allies you can see within 30 feet of you (maximum bonus of +5). Once you use this trait, you can't use it again until you finish a short or long rest."
            },
            {
                "race_name": "Hobgoblin",
                "name": "Size",
                "source_name": "VGM",
                "text": "Hobgoblins are between 5 and 6 feet tall and weigh between 150 and 200 pounds. Your size is Medium."
            }
        ]
    },
    {
        "type": "race",
        "name": "Simic Hybrid",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "GGR",
        "RacialTraits": [
            {
                "race_name": "Simic Hybrid",
                "name": "Animal Enhancement",
                "source_name": "GGR",
                "text": "Your body has been altered to incorporate certain animal characteristics. You choose one animal enhancement now and a second enhancement at 5th level.,At 1st level, choose one of the following options:,[object Object],At 5th level, your body evolves further, developing new characteristics. Choose one of the options you didn't take at 1st level, or one of the following options:,[object Object]"
            },
            {
                "race_name": "Simic Hybrid",
                "name": "Age",
                "source_name": "GGR",
                "text": "Hybrids begin their lives as adult humans, elves, or vedalken. They age at a slightly accelerated rate, so their maximum life spans are probably reduced somewhat. The Guardian Project has not been operating long enough to observe the full effect of this phenomenon."
            },
            {
                "race_name": "Simic Hybrid",
                "name": "Alignment",
                "source_name": "GGR",
                "text": "Most hybrids share the generally neutral outlook of the Simic Combine. They are more interested in scientific research and the standing of their guild than in moral or ethical questions. Those who leave the Combine, however, often do so because their philosophical outlook and alignment are more in line with a different guild's."
            },
            {
                "race_name": "Simic Hybrid",
                "name": "Darkvision",
                "source_name": "GGR",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Simic Hybrid",
                "name": "Size",
                "source_name": "GGR",
                "text": "Your size is Medium, within the normal range of your humanoid base race."
            },
            {
                "race_name": "Simic Hybrid",
                "name": "Languages",
                "source_name": "GGR",
                "text": "You can speak, read, and write Common and your choice of Elvish or Vedalken."
            }
        ]
    },
    {
        "type": "race",
        "name": "Shadar-Kai",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Shadar-Kai",
                "name": "Keen Senses",
                "source_name": "MPMM",
                "text": "You have proficiency in the {@skill Perception} skill."
            },
            {
                "race_name": "Shadar-Kai",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Shadar-Kai",
                "name": "Blessing of the Raven Queen",
                "source_name": "MPMM",
                "text": "As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.,Start at 3rd level, you also gain resistance to all damage when you teleport using this trait. The resistance lasts until the start of your next turn. During that time, you appear ghostly and translucent."
            },
            {
                "race_name": "Shadar-Kai",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Humanoid. You are also considered an elf for any prerequisite or effect that requires you to be an elf."
            },
            {
                "race_name": "Shadar-Kai",
                "name": "Fey Ancestry",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws you make to avoid or end the {@condition charmed} condition on yourself."
            },
            {
                "race_name": "Shadar-Kai",
                "name": "Trance",
                "source_name": "MPMM",
                "text": "You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness.,Whenever you finish this trance, you can gain two proficiencies that you don't have, each one with a weapon or a tool of your choice selected from the Player's Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory, and you retain them until you finish your next long rest."
            },
            {
                "race_name": "Shadar-Kai",
                "name": "Necrotic Resistance",
                "source_name": "MPMM",
                "text": "You have resistance to necrotic damage."
            }
        ]
    },
    {
        "type": "race",
        "name": "Dragonborn (Metallic)",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "FTD",
        "RacialTraits": [
            {
                "race_name": "Dragonborn (Metallic)",
                "name": "Metallic Ancestry",
                "source_name": "FTD",
                "text": "You have a metallic dragon ancestor, granting you a special magical affinity. Choose one kind of dragon from the Metallic Ancestry table. This determines the damage type for your other traits, as shown in the table.,[object Object]"
            },
            {
                "race_name": "Dragonborn (Metallic)",
                "name": "Breath Weapon",
                "source_name": "FTD",
                "text": "When you take the {@action Attack} action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 15-foot cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes {@damage 1d10} damage of the type associated with your Metallic Ancestry. On a successful save, it takes half as much damage. This damage increases by {@dice 1d10} when you reach 5th level ({@dice 2d10}), 11th level ({@dice 3d10}), and 17th level ({@dice 4d10}).,You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Dragonborn (Metallic)",
                "name": "Draconic Resistance",
                "source_name": "FTD",
                "text": "You have resistance to the damage type associated with your Metallic Ancestry."
            },
            {
                "race_name": "Dragonborn (Metallic)",
                "name": "Metallic Breath Weapon",
                "source_name": "FTD",
                "text": "At 5th level, you gain a second breath weapon. When you take the {@action Attack} action on your turn, you can replace one of your attacks with an exhalation in a 15-foot cone. The save DC for this breath is 8 + your Constitution modifier + your proficiency bonus. Whenever you use this trait, choose one:,[object Object],Once you use your Metallic Breath Weapon, you can't do so again until you finish a long rest."
            }
        ]
    },
    {
        "type": "race",
        "name": "Merfolk",
        "speed": "10",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Merfolk",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Common and Aquan."
            },
            {
                "race_name": "Merfolk",
                "name": "Amphibious",
                "source_name": "DMG",
                "text": "You can breathe air and water."
            }
        ]
    },
    {
        "type": "race",
        "name": "Tabaxi",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Tabaxi",
                "name": "Cat's Claws",
                "source_name": "MPMM",
                "text": "You can use your claws to make unarmed strikes. When you hit with them, the strike deals {@damage 1d6} + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Tabaxi",
                "name": "Cat's Talent",
                "source_name": "MPMM",
                "text": "You have proficiency in the {@skill Perception} and {@skill Stealth} skills."
            },
            {
                "race_name": "Tabaxi",
                "name": "Size",
                "source_name": "MPMM",
                "text": "You are Medium or Small. You choose the size when you select this race."
            },
            {
                "race_name": "Tabaxi",
                "name": "Speed",
                "source_name": "MPMM",
                "text": "Your walking speed is 30 feet, and you have a climbing speed equal to your walking speed."
            },
            {
                "race_name": "Tabaxi",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Tabaxi",
                "name": "Feline Agility",
                "source_name": "MPMM",
                "text": "Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."
            }
        ]
    },
    {
        "type": "race",
        "name": "Shifter",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "ERLW",
        "RacialTraits": [
            {
                "race_name": "Shifter",
                "name": "Languages",
                "source_name": "ERLW",
                "text": "You can speak, read, and write Common."
            },
            {
                "race_name": "Shifter",
                "name": "Speed",
                "source_name": "ERLW",
                "text": "Your base walking speed is 30 feet."
            },
            {
                "race_name": "Shifter",
                "name": "Size",
                "source_name": "ERLW",
                "text": "Your size is Medium."
            },
            {
                "race_name": "Shifter",
                "name": "Alignment",
                "source_name": "ERLW",
                "text": "Shifters tend toward neutrality, being more focused on survival than concepts of good and evil. A love of personal freedom can drive shifters toward chaotic alignments."
            },
            {
                "race_name": "Shifter",
                "name": "Shifting",
                "source_name": "ERLW",
                "text": "As a bonus action, you can assume a more bestial appearance. This transformation lasts for 1 minute, until you die, or until you revert to your normal appearance as a bonus action. When you shift, you gain temporary hit points equal to your level + your Constitution modifier (minimum of 1 temporary hit point). You also gain additional benefits that depend on your shifter subrace, described below.,Once you shift, you can't do so again until you finish a short or long rest."
            },
            {
                "race_name": "Shifter",
                "name": "Age",
                "source_name": "ERLW",
                "text": "Shifters are quick to mature both physically and emotionally, reaching young adulthood at age 10. They rarely live to be more than 70 years old."
            },
            {
                "race_name": "Shifter",
                "name": "Darkvision",
                "source_name": "ERLW",
                "text": "You have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Kuo-Toa",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Kuo-Toa",
                "name": "Superior Darkvision",
                "source_name": "DMG",
                "text": "You have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Kuo-Toa",
                "name": "Otherworldly Perception",
                "source_name": "DMG",
                "text": "You can sense the presence of any creature within 30 feet of you that is {@condition invisible} or on the Ethereal Plane. You can pinpoint such a creature that is moving."
            },
            {
                "race_name": "Kuo-Toa",
                "name": "Slippery",
                "source_name": "DMG",
                "text": "You have advantage on ability checks and saving throws made to escape a grapple."
            },
            {
                "race_name": "Kuo-Toa",
                "name": "Amphibious",
                "source_name": "DMG",
                "text": "You can breathe air and water."
            },
            {
                "race_name": "Kuo-Toa",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Undercommon."
            },
            {
                "race_name": "Kuo-Toa",
                "name": "Sunlight Sensitivity",
                "source_name": "DMG",
                "text": "While in sunlight, you have disadvantage on attack rolls, as well as on Wisdom ({@skill Perception}) checks that rely on sight."
            }
        ]
    },
    {
        "type": "race",
        "name": "Changeling",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Changeling",
                "name": "Changeling Instincts",
                "source_name": "MPMM",
                "text": "Thanks to your connection to the fey realm, you gain proficiency with two of the following skills of your choice: {@skill Deception}, {@skill Insight}, {@skill Intimidation}, {@skill Performance}, or {@skill Persuasion}."
            },
            {
                "race_name": "Changeling",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Fey."
            },
            {
                "race_name": "Changeling",
                "name": "Size",
                "source_name": "MPMM",
                "text": "You are Medium or Small. You choose the size when you select this race."
            },
            {
                "race_name": "Changeling",
                "name": "Shapechanger",
                "source_name": "MPMM",
                "text": "As an action, you change your appearance and your voice. You determine the specifics of the changes, including your coloration, hair length, and sex. You can also adjust your height between Medium and Small. You can make yourself appear as a member of another race, though none of your game statistics change. You can't duplicate the appearance of an individual you've never seen, and you must adopt a form that has the same basic arrangement of limbs that you have. Your clothing and equipment aren't changed by this trait.,You stay in the new form until you use an action to revert to your true form or until you die."
            }
        ]
    },
    {
        "type": "race",
        "name": "Minotaur",
        "speed": "0",
        "str": "2",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "GGR",
        "RacialTraits": [
            {
                "race_name": "Minotaur",
                "name": "Languages",
                "source_name": "GGR",
                "text": "You can speak, read, and write Common and Minotaur."
            },
            {
                "race_name": "Minotaur",
                "name": "Size",
                "source_name": "GGR",
                "text": "Minotaurs average over 6 feet in height, and they have stocky builds. Your size is Medium."
            },
            {
                "race_name": "Minotaur",
                "name": "Note",
                "source_name": "GGR",
                "text": "{@note These traits are also suitable for minotaurs in other D&D worlds where these people have avoided the demonic influence of Baphomet.}"
            },
            {
                "race_name": "Minotaur",
                "name": "Age",
                "source_name": "GGR",
                "text": "Minotaurs enter adulthood at around the age of 17 and can live up to 150 years."
            },
            {
                "race_name": "Minotaur",
                "name": "Goring Rush",
                "source_name": "GGR",
                "text": "Immediately after you use the {@action Dash} action on your turn and move at least 20 feet, you can make one melee attack with your horns as a bonus action."
            },
            {
                "race_name": "Minotaur",
                "name": "Imposing Presence",
                "source_name": "GGR",
                "text": "You have proficiency in one of the following skills of your choice: {@skill Intimidation} or {@skill Persuasion}."
            },
            {
                "race_name": "Minotaur",
                "name": "Horns",
                "source_name": "GGR",
                "text": "Your horns are natural melee weapons, which you can use to make unarmed strikes. If you hit with them, you deal piercing damage equal to {@dice 1d6} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Minotaur",
                "name": "Alignment",
                "source_name": "GGR",
                "text": "Most minotaurs who join the Boros Legion lean toward lawful alignments, while those associated with the Cult of Rakdos or the Gruul Clans tend toward chaotic alignments."
            },
            {
                "race_name": "Minotaur",
                "name": "Hammering Horns",
                "source_name": "GGR",
                "text": "Immediately after you hit a creature with a melee attack as part of the {@action Attack} action on your turn, you can use a bonus action to attempt to shove that target with your horns. The target must be no more than one size larger than you and within 5 feet of you. Unless it succeeds on a Strength saving throw against a DC equal to 8 + your proficiency bonus + your Strength modifier, you push it up to 10 feet away from you."
            }
        ]
    },
    {
        "type": "race",
        "name": "Genasi",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Genasi",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Genasi",
                "name": "Size",
                "source_name": "MPMM",
                "text": "You are Medium or Small. You choose the size when you select this race."
            }
        ]
    },
    {
        "type": "race",
        "name": "Kobold",
        "speed": "0",
        "str": "-4",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Kobold",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Common and Draconic."
            },
            {
                "race_name": "Kobold",
                "name": "Pack Tactics",
                "source_name": "DMG",
                "text": "You have advantage on an attack roll against a creature if at least one of your allies is within 5 feet of the creature and the ally isn't {@condition incapacitated}."
            },
            {
                "race_name": "Kobold",
                "name": "Sunlight Sensitivity",
                "source_name": "DMG",
                "text": "You have disadvantage on attack rolls and on Wisdom ({@skill Perception}) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
            },
            {
                "race_name": "Kobold",
                "name": "Darkvision",
                "source_name": "DMG",
                "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Half-Orc (Mark of Finding)",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "2",
        "source_name": "ERLW",
        "RacialTraits": [
            {
                "race_name": "Half-Orc (Mark of Finding)",
                "name": "Age",
                "source_name": "ERLW",
                "text": "Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years."
            },
            {
                "race_name": "Half-Orc (Mark of Finding)",
                "name": "Spells of the Mark",
                "source_name": "ERLW",
                "text": "If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Finding Spells table are added to the spell list of your spellcasting class.,[object Object]"
            },
            {
                "race_name": "Half-Orc (Mark of Finding)",
                "name": "Darkvision",
                "source_name": "ERLW",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Half-Orc (Mark of Finding)",
                "name": "Hunter's Intuition",
                "source_name": "ERLW",
                "text": "When you make a Wisdom ({@skill Perception}) or Wisdom ({@skill Survival}) check, you can roll a {@dice d4} and add the number rolled to the ability check."
            },
            {
                "race_name": "Half-Orc (Mark of Finding)",
                "name": "Languages",
                "source_name": "ERLW",
                "text": "You can speak, read, and write Common and Goblin."
            },
            {
                "race_name": "Half-Orc (Mark of Finding)",
                "name": "Finder's Magic",
                "source_name": "ERLW",
                "text": "You can cast the {@spell hunter's mark} spell with this trait. Starting at 3rd level, you can also cast the {@spell locate object} spell with it. Once you cast either spell with this trait, you can't cast that spell with it again until you finish a long rest. Wisdom is your spellcasting ability for these spells."
            },
            {
                "race_name": "Half-Orc (Mark of Finding)",
                "name": "Size",
                "source_name": "ERLW",
                "text": "Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium."
            },
            {
                "race_name": "Half-Orc (Mark of Finding)",
                "name": "Alignment",
                "source_name": "ERLW",
                "text": "Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil."
            }
        ]
    },
    {
        "type": "race",
        "name": "Centaur",
        "speed": "0",
        "str": "2",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "1",
        "source_name": "GGR",
        "RacialTraits": [
            {
                "race_name": "Centaur",
                "name": "Charge",
                "source_name": "GGR",
                "text": "If you move at least 30 feet straight toward a target and then hit it with a melee weapon attack on the same turn, you can immediately follow that attack with a bonus action, making one attack against the target with your hooves."
            },
            {
                "race_name": "Centaur",
                "name": "Equine Build",
                "source_name": "GGR",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push or drag.,In addition, any climb that requires hands and feet is especially difficult for you because of your equine legs. When you make such a climb, each foot of movement costs you 4 extra feet, instead of the normal 1 extra foot."
            },
            {
                "race_name": "Centaur",
                "name": "Languages",
                "source_name": "GGR",
                "text": "You can speak, read, and write Common and Sylvan. Sylvan is widely spoken in the Selesnya Conclave, for it is rich in vocabulary to describe natural phenomena and spiritual forces."
            },
            {
                "race_name": "Centaur",
                "name": "Survivor",
                "source_name": "GGR",
                "text": "You have proficiency in one of the following skills of your choice: {@skill Animal Handling}, {@skill Medicine}, {@skill Nature}, or {@skill Survival}."
            },
            {
                "race_name": "Centaur",
                "name": "Alignment",
                "source_name": "GGR",
                "text": "Centaurs are inclined toward neutrality. Those who join the Selesnya are more often neutral good, while those who join the Gruul are typically chaotic neutral."
            },
            {
                "race_name": "Centaur",
                "name": "Hooves",
                "source_name": "GGR",
                "text": "Your hooves are natural melee weapons, which you can use to make unarmed strikes. If you hit with them, you deal bludgeoning damage equal to {@damage 1d4} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
            },
            {
                "race_name": "Centaur",
                "name": "Fey",
                "source_name": "GGR",
                "text": "Your creature type is fey, rather than humanoid."
            },
            {
                "race_name": "Centaur",
                "name": "Size",
                "source_name": "GGR",
                "text": "Centaurs stand between 6 and 7 feet tall, with their equine bodies reaching about 4 feet at the withers. Your size is Medium."
            },
            {
                "race_name": "Centaur",
                "name": "Age",
                "source_name": "GGR",
                "text": "Centaurs mature and age at about the same rate as humans."
            }
        ]
    },
    {
        "type": "race",
        "name": "Kenku",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "1",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Kenku",
                "name": "Expert Forgery",
                "source_name": "VGM",
                "text": "You can duplicate other creatures' handwriting and craftwork. You have advantage on all checks made to produce forgeries or duplicates of existing objects."
            },
            {
                "race_name": "Kenku",
                "name": "Size",
                "source_name": "VGM",
                "text": "Kenku are around 5 feet tall and weigh between 90 and 120 pounds. Your size is Medium."
            },
            {
                "race_name": "Kenku",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can read and write Common and Auran, but you can only speak using your Mimicry trait."
            },
            {
                "race_name": "Kenku",
                "name": "Mimicry",
                "source_name": "VGM",
                "text": "You can mimic sounds you have heard, including voices. A creature that hears the sounds can tell they are imitations with a successful Wisdom ({@skill Insight}) check opposed by your Charisma ({@skill Deception}) check."
            },
            {
                "race_name": "Kenku",
                "name": "Kenku Training",
                "source_name": "VGM",
                "text": "You are proficient in your choice of two of the following skills: {@skill Acrobatics}, {@skill Deception}, {@skill Stealth}, and {@skill Sleight of Hand}."
            },
            {
                "race_name": "Kenku",
                "name": "Age",
                "source_name": "VGM",
                "text": "Kenku have shorter lifespans than humans. They reach maturity at about 12 years old and can live to 60."
            }
        ]
    },
    {
        "type": "race",
        "name": "Skeleton",
        "speed": "0",
        "str": "0",
        "int": "-4",
        "cos": "0",
        "dex": "2",
        "cha": "-4",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Skeleton",
                "name": "Undead Nature",
                "source_name": "DMG",
                "text": "You are immune to poison damage and {@condition exhaustion}, and you can't be {@condition poisoned}. You don't require air, food, drink, or sleep."
            },
            {
                "race_name": "Skeleton",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can't speak, but you can understand the languages you knew in life."
            },
            {
                "race_name": "Skeleton",
                "name": "Brittle Bones",
                "source_name": "DMG",
                "text": "You are vulnerable to bludgeoning damage."
            },
            {
                "race_name": "Skeleton",
                "name": "Darkvision",
                "source_name": "DMG",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Githyanki",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Githyanki",
                "name": "Psychic Resilience",
                "source_name": "MPMM",
                "text": "You have resistance to psychic damage."
            },
            {
                "race_name": "Githyanki",
                "name": "Astral Knowledge",
                "source_name": "MPMM",
                "text": "You can mystically access a reservoir of experiences of entities connected to the Astral Plane. Whenever you finish a long rest, you gain proficiency in one skill of your choice and with one weapon or tool of your choice, selected from the Player's Handbook, as you momentarily project your consciousness into the Astral Plane. These proficiencies last until the end of your next long rest."
            },
            {
                "race_name": "Githyanki",
                "name": "Githyanki Psionics",
                "source_name": "MPMM",
                "text": "You know the {@spell mage hand} cantrip, and the hand is {@condition invisible} when you cast the cantrip with this trait.,Starting at 3rd level, you can cast the {@spell jump} spell with this trait. Starting at 5th level, you can also cast {@spell misty step} with it. Once you cast {@spell jump} or {@spell misty step} with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.,Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race). None of these spells require spell components when you cast them with this trait."
            }
        ]
    },
    {
        "type": "race",
        "name": "Aasimar",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Aasimar",
                "name": "Size",
                "source_name": "MPMM",
                "text": "You are Medium or Small. You choose the size when you select this race."
            },
            {
                "race_name": "Aasimar",
                "name": "Celestial Revelation",
                "source_name": "MPMM",
                "text": "When you reach 3rd level, choose one of the revelation options below. Thereafter, you can use a bonus action to unleash the celestial energy within yourself, gaining the benefits of that revelation. Your transformation lasts for 1 minute or until you end it as a bonus action. Once you transform using your revelation below, you can't use it again until you finish a long rest.,[object Object]"
            },
            {
                "race_name": "Aasimar",
                "name": "Light Bearer",
                "source_name": "MPMM",
                "text": "You know the {@spell light} cantrip. Charisma is your spellcasting ability for it."
            },
            {
                "race_name": "Aasimar",
                "name": "Celestial Resistance",
                "source_name": "MPMM",
                "text": "You have resistance to necrotic damage and radiant damage."
            },
            {
                "race_name": "Aasimar",
                "name": "Healing Hands",
                "source_name": "MPMM",
                "text": "As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest."
            },
            {
                "race_name": "Aasimar",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Dhampir",
        "speed": "35",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "VRGR",
        "RacialTraits": [
            {
                "race_name": "Dhampir",
                "name": "Deathless Nature",
                "source_name": "VRGR",
                "text": "You don't need to breathe."
            },
            {
                "race_name": "Dhampir",
                "name": "Size",
                "source_name": "VRGR",
                "text": "You are Medium or Small. You choose the size when you gain this lineage."
            },
            {
                "race_name": "Dhampir",
                "name": "Vampiric Bite",
                "source_name": "VRGR",
                "text": "Your fanged bite is a natural weapon, which counts as a simple melee weapon with which you are proficient. You add your Constitution modifier, instead of your Strength modifier, to the attack and damage rolls when you attack with this bite. It deals {@damage 1d4} piercing damage on a hit. While you are missing half or more of your hit points, you have advantage on attack rolls you make with this bite.,When you attack with this bite and hit a creature that isn't a Construct or an Undead, you can empower yourself in one of the following ways of your choice:,[object Object],You can empower yourself with this bite a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Dhampir",
                "name": "Spider Climb",
                "source_name": "VRGR",
                "text": "You have a climbing speed equal to your walking speed. In addition, at 3rd level, you can move up, down, and across vertical surfaces and upside down along ceilings, while leaving your hands free."
            },
            {
                "race_name": "Dhampir",
                "name": "Darkvision",
                "source_name": "VRGR",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness as shades of gray."
            },
            {
                "race_name": "Dhampir",
                "name": "Ancestral Legacy",
                "source_name": "VRGR",
                "text": "If you replace a race with this lineage, you can keep the following elements of that race: any skill proficiencies you gained from it and any climbing, flying, or swimming speed you gained from it.,If you don't keep any of those elements or you choose this lineage at character creation, you gain proficiency in two skills of your choice."
            }
        ]
    },
    {
        "type": "race",
        "name": "Goliath",
        "speed": "0",
        "str": "2",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Goliath",
                "name": "Mountain Born",
                "source_name": "VGM",
                "text": "You have resistance to cold damage. You're also acclimated to high altitude, including elevations above 20,000 feet."
            },
            {
                "race_name": "Goliath",
                "name": "Natural Athlete",
                "source_name": "VGM",
                "text": "You have proficiency in the {@skill Athletics} skill."
            },
            {
                "race_name": "Goliath",
                "name": "Age",
                "source_name": "VGM",
                "text": "Goliaths have lifespans comparable to humans. They enter adulthood in their late teens and usually live less than a century."
            },
            {
                "race_name": "Goliath",
                "name": "Powerful Build",
                "source_name": "VGM",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
            },
            {
                "race_name": "Goliath",
                "name": "Size",
                "source_name": "VGM",
                "text": "Goliaths are between 7 and 8 feet tall and weigh between 280 and 340 pounds. Your size is Medium."
            },
            {
                "race_name": "Goliath",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common and Giant."
            },
            {
                "race_name": "Goliath",
                "name": "Stone's Endurance",
                "source_name": "VGM",
                "text": "You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a {@dice d12}. Add your Constitution modifier to the number rolled, and reduce the damage by that total. After you use this trait, you can't use it again until you finish a short or long rest."
            }
        ]
    },
    {
        "type": "race",
        "name": "Vedalken",
        "speed": "0",
        "str": "0",
        "int": "2",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "1",
        "source_name": "GGR",
        "RacialTraits": [
            {
                "race_name": "Vedalken",
                "name": "Age",
                "source_name": "GGR",
                "text": "Vedalken mature slower than humans do, reaching maturity around age 40. Their life span is typically 350 years, with some living to the age of 500."
            },
            {
                "race_name": "Vedalken",
                "name": "Vedalken Dispassion",
                "source_name": "GGR",
                "text": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws."
            },
            {
                "race_name": "Vedalken",
                "name": "Languages",
                "source_name": "GGR",
                "text": "You can speak, read, and write Common, Vedalken, and one other language of your choice."
            },
            {
                "race_name": "Vedalken",
                "name": "Partially Amphibious",
                "source_name": "GGR",
                "text": "By absorbing oxygen through your skin, you can breathe underwater for up to 1 hour. Once you've reached that limit, you can't use this trait again until you finish a long rest."
            },
            {
                "race_name": "Vedalken",
                "name": "Size",
                "source_name": "GGR",
                "text": "Tall and slender, Vedalken stand 6 to 6½ feet tall on average and usually weigh less than 200 pounds. Your size is Medium."
            },
            {
                "race_name": "Vedalken",
                "name": "Tireless Precision",
                "source_name": "GGR",
                "text": "You are proficient in one of the following skills of your choice: {@skill Arcana}, {@skill History}, {@skill Investigation}, {@skill Medicine}, {@skill Performance}, or {@skill Sleight of Hand}. You are also proficient with one {@book tool|phb|5|tools} of your choice.,Whenever you make an ability check with the chosen skill or tool, roll a {@dice d4} and add the number rolled to the check's total."
            },
            {
                "race_name": "Vedalken",
                "name": "Alignment",
                "source_name": "GGR",
                "text": "Vedalken are usually lawful and non-evil."
            }
        ]
    },
    {
        "type": "race",
        "name": "Orc",
        "speed": "0",
        "str": "2",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "ERLW",
        "RacialTraits": [
            {
                "race_name": "Orc",
                "name": "Primal Intuition",
                "source_name": "ERLW",
                "text": "You have proficiency in two of the following skills of your choice: {@skill Animal Handling}, {@skill Insight}, {@skill Intimidation}, {@skill Medicine}, {@skill Nature}, {@skill Perception}, and {@skill Survival}."
            },
            {
                "race_name": "Orc",
                "name": "Powerful Build",
                "source_name": "ERLW",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
            },
            {
                "race_name": "Orc",
                "name": "Alignment",
                "source_name": "ERLW",
                "text": "The orcs of Eberron are a passionate people, given to powerful emotion and deep faith. They are generally chaotic, but can be any alignment."
            },
            {
                "race_name": "Orc",
                "name": "Darkvision",
                "source_name": "ERLW",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Orc",
                "name": "Size",
                "source_name": "ERLW",
                "text": "Your size is Medium."
            },
            {
                "race_name": "Orc",
                "name": "Age",
                "source_name": "ERLW",
                "text": "Orcs reach adulthood at age 12 and live up to 50 years."
            },
            {
                "race_name": "Orc",
                "name": "Languages",
                "source_name": "ERLW",
                "text": "You can speak, read, and write Common and Orc."
            },
            {
                "race_name": "Orc",
                "name": "Aggressive",
                "source_name": "ERLW",
                "text": "As a bonus action, you can move up to your movement speed toward a hostile creature you can see or hear. You must end this move closer to the enemy than you started."
            }
        ]
    },
    {
        "type": "race",
        "name": "Aasimar",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "2",
        "wis": "1",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Aasimar",
                "name": "Celestial Legacy",
                "source_name": "DMG",
                "text": "You know the {@spell light} cantrip. Once you reach 3rd level, you can cast the {@spell lesser restoration} spell once with this trait, and you regain the ability to do so when you finish a long rest. Once you reach 5th level, you can cast the {@spell daylight} spell once with this trait, and you regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells."
            },
            {
                "race_name": "Aasimar",
                "name": "Darkvision",
                "source_name": "DMG",
                "text": "Thanks to your celestial heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of grey."
            },
            {
                "race_name": "Aasimar",
                "name": "Celestial Resistance",
                "source_name": "DMG",
                "text": "You have resistance to necrotic and radiant damage."
            },
            {
                "race_name": "Aasimar",
                "name": "Language",
                "source_name": "DMG",
                "text": "You can speak, read, and write Common and Celestial."
            },
            {
                "race_name": "Aasimar",
                "name": "Size",
                "source_name": "DMG",
                "text": "Aasimar are built like well-proportioned humans. Your size is Medium."
            },
            {
                "race_name": "Aasimar",
                "name": "Age",
                "source_name": "DMG",
                "text": "Aasimar mature at the same rate as humans but live a few years longer."
            }
        ]
    },
    {
        "type": "race",
        "name": "Yuan-Ti",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Yuan-Ti",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Yuan-Ti",
                "name": "Size",
                "source_name": "MPMM",
                "text": "You are Medium or Small. You choose the size when you select this race."
            },
            {
                "race_name": "Yuan-Ti",
                "name": "Magic Resistance",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws against spells."
            },
            {
                "race_name": "Yuan-Ti",
                "name": "Serpentine Spellcasting",
                "source_name": "MPMM",
                "text": "You know the {@spell poison spray} cantrip. You can cast {@spell animal friendship} an unlimited number of times with this trait, but you can target only snakes with it. Starting at 3rd level, you can also cast {@spell suggestion} with this trait. Once you cast it, you can't do so again until you finish a long rest. You can also cast it using any spell slots you have of 2nd level or higher.,Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
            },
            {
                "race_name": "Yuan-Ti",
                "name": "Poison Resilience",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws you make to avoid or end the {@condition poisoned} condition on yourself. You also have resistance to poison damage."
            }
        ]
    },
    {
        "type": "race",
        "name": "Grung",
        "speed": "25",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "0",
        "source_name": "OGA",
        "RacialTraits": [
            {
                "race_name": "Grung",
                "name": "Amphibious",
                "source_name": "OGA",
                "text": "You can breathe air and water."
            },
            {
                "race_name": "Grung",
                "name": "Size",
                "source_name": "OGA",
                "text": "Grungs stand between 2½ and 3½ feet tall and average about 30 pounds. Your size is Small."
            },
            {
                "race_name": "Grung",
                "name": "Arboreal Alertness",
                "source_name": "OGA",
                "text": "You have proficiency in the {@skill Perception} skill."
            },
            {
                "race_name": "Grung",
                "name": "Poisonous Skin",
                "source_name": "OGA",
                "text": "Any creature that grapples you or otherwise comes into direct contact with your skin must succeed on a DC 12 Constitution saving throw or become {@condition poisoned} for 1 minute. A {@condition poisoned} creature no longer in direct contact with you can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.,You can also apply this poison to any piercing weapon as part of an attack with that weapon, though when you hit the poison reacts differently. The target must succeed on a DC 12 Constitution saving throw or take {@dice 2d4} poison damage."
            },
            {
                "race_name": "Grung",
                "name": "Age",
                "source_name": "OGA",
                "text": "Grungs mature to adulthood in a single year, but have been known to live up to 50 years."
            },
            {
                "race_name": "Grung",
                "name": "Poison Immunity",
                "source_name": "OGA",
                "text": "You're immune to poison damage and the {@condition poisoned} condition."
            },
            {
                "race_name": "Grung",
                "name": "Standing Leap",
                "source_name": "OGA",
                "text": "Your long jump is up to 25 feet and your high jump is up to 15 feet, with or without a running start."
            },
            {
                "race_name": "Grung",
                "name": "Alignment",
                "source_name": "OGA",
                "text": "Most grungs are lawful, having been raised in a strict caste system. They tend toward evil as well, coming from a culture where social advancement occurs rarely, and most often because another member of your army has died and there is no one else of that caste to fill the vacancy."
            },
            {
                "race_name": "Grung",
                "name": "Water Dependency",
                "source_name": "OGA",
                "text": "If you fail to immerse yourself in water for at least 1 hour during a day, you suffer one level of {@condition exhaustion} at the end of that day. You can only recover from this {@condition exhaustion} through magic or by immersing yourself in water for at least 1 hour."
            },
            {
                "race_name": "Grung",
                "name": "Languages",
                "source_name": "OGA",
                "text": "You can speak, read, and write Grung."
            }
        ]
    },
    {
        "type": "race",
        "name": "Kenku",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Kenku",
                "name": "Mimicry",
                "source_name": "DMG",
                "text": "You can mimic any sounds you have heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 14 Wisdom ({@skill Insight}) check."
            },
            {
                "race_name": "Kenku",
                "name": "Ambusher",
                "source_name": "DMG",
                "text": "In the first round of a combat, you have advantage on attack rolls against any creature who is {@quickref Surprise|PHB|3|0|surprised}."
            },
            {
                "race_name": "Kenku",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can read and write Common and Auran, but you can only speak using your Mimicry trait."
            }
        ]
    },
    {
        "type": "race",
        "name": "Troglodyte",
        "speed": "0",
        "str": "2",
        "int": "-4",
        "cos": "0",
        "dex": "0",
        "cha": "-4",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Troglodyte",
                "name": "Sunlight Sensitivity",
                "source_name": "DMG",
                "text": "While in sunlight, you have disadvantage on attack rolls, as well as on Wisdom ({@skill Perception}) checks that rely on sight."
            },
            {
                "race_name": "Troglodyte",
                "name": "Stench",
                "source_name": "DMG",
                "text": "Any creature other than a troglodyte that starts its turn within 5 ft. of you must succeed on a DC 12 Constitution saving throw or be {@condition poisoned} until the start of the creature's next turn. On a successful saving throw, the creature is immune to the stench of all troglodytes for 1 hour."
            },
            {
                "race_name": "Troglodyte",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Troglodyte."
            },
            {
                "race_name": "Troglodyte",
                "name": "Darkvision",
                "source_name": "DMG",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Troglodyte",
                "name": "Chameleon Skin",
                "source_name": "DMG",
                "text": "You have advantage on Dexterity ({@skill Stealth}) checks made to hide."
            },
            {
                "race_name": "Troglodyte",
                "name": "Natural Armor",
                "source_name": "DMG",
                "text": "Your thick hide grants you a +1 bonus to Armor Class."
            }
        ]
    },
    {
        "type": "race",
        "name": "Loxodon",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "1",
        "source_name": "GGR",
        "RacialTraits": [
            {
                "race_name": "Loxodon",
                "name": "Loxodon Serenity",
                "source_name": "GGR",
                "text": "You have advantage on saving throws against being {@condition charmed} or {@condition frightened}."
            },
            {
                "race_name": "Loxodon",
                "name": "Trunk",
                "source_name": "GGR",
                "text": "You can grasp things with your trunk, and you can use it as a snorkel. It has a reach of 5 feet, and it can lift a number of pounds equal to five times your Strength score. You can use it to do the following simple tasks: lift, drop, hold, push, or pull an object or a creature; open or close a door or a container; grapple someone; or make an unarmed strike. Your DM might allow other simple tasks to be added to that list of options.,Your trunk can't wield weapons or shields or do anything that requires manual precision, such as using tools or magic items or performing the somatic components of a spell."
            },
            {
                "race_name": "Loxodon",
                "name": "Alignment",
                "source_name": "GGR",
                "text": "Most loxodons are lawful, believing in the value of a peaceful, ordered life. They also tend toward good."
            },
            {
                "race_name": "Loxodon",
                "name": "Keen Smell",
                "source_name": "GGR",
                "text": "Thanks to your sensitive trunk, you have advantage on Wisdom ({@skill Perception}), Wisdom ({@skill Survival}), and Intelligence ({@skill Investigation}) checks that involve smell."
            },
            {
                "race_name": "Loxodon",
                "name": "Natural Armor",
                "source_name": "GGR",
                "text": "You have thick, leathery skin. When you aren't wearing armor, your AC is 12 + your Constitution modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor.,[object Object]"
            },
            {
                "race_name": "Loxodon",
                "name": "Powerful Build",
                "source_name": "GGR",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
            },
            {
                "race_name": "Loxodon",
                "name": "Age",
                "source_name": "GGR",
                "text": "Loxodons physically mature at the same rate as humans, but they live about 450 years. They highly value the weight of wisdom and experience and are considered young until they reach the age of 60."
            },
            {
                "race_name": "Loxodon",
                "name": "Size",
                "source_name": "GGR",
                "text": "Loxodons stand between 7 and 8 feet tall. Their massive bodies weigh between 300 and 400 pounds. Your size is Medium."
            },
            {
                "race_name": "Loxodon",
                "name": "Languages",
                "source_name": "GGR",
                "text": "You can speak, read, and write Common and Loxodon."
            }
        ]
    },
    {
        "type": "race",
        "name": "Duergar",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Duergar",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Humanoid. You are also considered a dwarf for any prerequisite or effect that requires you to be a dwarf."
            },
            {
                "race_name": "Duergar",
                "name": "Psionic Fortitude",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws you make to avoid or end the {@condition charmed} or {@condition stunned} condition on yourself."
            },
            {
                "race_name": "Duergar",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 120 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Duergar",
                "name": "Duergar Magic",
                "source_name": "MPMM",
                "text": "Starting at 3rd level, you can cast the {@spell enlarge/reduce} spell on yourself with this trait, without requiring a material component. Starting at 5th level, you can also cast the {@spell invisibility} spell on yourself with this trait, without requiring a material component. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level.,Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
            },
            {
                "race_name": "Duergar",
                "name": "Dwarven Resilience",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws you make to avoid or end the {@condition poisoned} condition on yourself. You also have resistance to poison damage."
            }
        ]
    },
    {
        "type": "race",
        "name": "Firbolg",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Firbolg",
                "name": "Speech of Beast and Leaf",
                "source_name": "MPMM",
                "text": "You have the ability to communicate in a limited manner with Beasts, Plants, and vegetation. They can understand the meaning of your words, though you have no special ability to understand them in return. You have advantage on all Charisma checks you make to influence them."
            },
            {
                "race_name": "Firbolg",
                "name": "Powerful Build",
                "source_name": "MPMM",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
            },
            {
                "race_name": "Firbolg",
                "name": "Hidden Step",
                "source_name": "MPMM",
                "text": "As a bonus action, you can magically turn {@condition invisible} until the start of your next turn or until you attack, make a damage roll, or force someone to make a saving throw. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Firbolg",
                "name": "Firbolg Magic",
                "source_name": "MPMM",
                "text": "You can cast {@spell detect magic} and {@spell disguise self} spells with this trait. When you use this version of {@spell disguise self}, you can seem up to 3 feet shorter or taller. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using any spell slots you have.,Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
            }
        ]
    },
    {
        "type": "race",
        "name": "Gnome (Deep)",
        "speed": "0",
        "str": "1",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Gnome (Deep)",
                "name": "Gnome Cunning",
                "source_name": "DMG",
                "text": "You have advantage on Intelligence, Wisdom, and Charisma saving throws against magic."
            },
            {
                "race_name": "Gnome (Deep)",
                "name": "Stone Camouflage",
                "source_name": "DMG",
                "text": "You have advantage on Dexterity ({@skill Stealth}) checks to hide in rocky terrain."
            },
            {
                "race_name": "Gnome (Deep)",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Gnomish, Terran, and Undercommon."
            },
            {
                "race_name": "Gnome (Deep)",
                "name": "Innate Spellcasting",
                "source_name": "DMG",
                "text": "You have an innate ability to cast the following spells, requiring no material components:,[object Object],Intelligence is your spellcasting ability for these spells."
            },
            {
                "race_name": "Gnome (Deep)",
                "name": "Superior Darkvision",
                "source_name": "DMG",
                "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Half-Elf",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "2",
        "wis": "0",
        "source_name": "PHB",
        "RacialTraits": [
            {
                "race_name": "Half-Elf",
                "name": "Size",
                "source_name": "PHB",
                "text": "Half-elves are about the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium."
            },
            {
                "race_name": "Half-Elf",
                "name": "Languages",
                "source_name": "PHB",
                "text": "You can speak, read, and write Common, Elvish, and one extra language of your choice."
            },
            {
                "race_name": "Half-Elf",
                "name": "Fey Ancestry",
                "source_name": "PHB",
                "text": "You have advantage on saving throws against being {@condition charmed}, and magic can't put you to sleep."
            },
            {
                "race_name": "Half-Elf",
                "name": "Age",
                "source_name": "PHB",
                "text": "Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 180 years."
            },
            {
                "race_name": "Half-Elf",
                "name": "Skill Versatility",
                "source_name": "PHB",
                "text": "You gain proficiency in two skills of your choice."
            },
            {
                "race_name": "Half-Elf",
                "name": "Darkvision",
                "source_name": "PHB",
                "text": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Shifter",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Shifter",
                "name": "Bestial Instincts",
                "source_name": "MPMM",
                "text": "Channeling the beast within, you have proficiency in one of the following skills of your choice: {@skill Acrobatics}, {@skill Athletics}, {@skill Intimidation}, or {@skill Survival}."
            },
            {
                "race_name": "Shifter",
                "name": "Shifting",
                "source_name": "MPMM",
                "text": "As a bonus action, you can assume a more bestial appearance. This transformation lasts for 1 minute, until you die, or until you revert to your normal appearance as a bonus action. When you shift, you gain temporary hit points equal to 2 × your proficiency bonus. You can shift a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.,Whenever you shift, you gain an additional benefit based on one of the following options (choose when you select this race):,[object Object]"
            },
            {
                "race_name": "Shifter",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were in dim light. You discern colors in that darkness only as shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Warforged",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "ERLW",
        "RacialTraits": [
            {
                "race_name": "Warforged",
                "name": "Languages",
                "source_name": "ERLW",
                "text": "You can speak, read, and write Common and one other language of your choice."
            },
            {
                "race_name": "Warforged",
                "name": "Alignment",
                "source_name": "ERLW",
                "text": "Most warforged take comfort in order and discipline, tending toward law and neutrality. But some have absorbed the morality, or lack thereof, of the beings with which they served."
            },
            {
                "race_name": "Warforged",
                "name": "Size",
                "source_name": "ERLW",
                "text": "Your size is Medium."
            },
            {
                "race_name": "Warforged",
                "name": "Sentry's Rest",
                "source_name": "ERLW",
                "text": "When you take a long rest, you must spend at least six hours in an inactive, motionless state, rather than sleeping. In this state, you appear inert, but it doesn't render you {@condition unconscious}, and you can see and hear as normal."
            },
            {
                "race_name": "Warforged",
                "name": "Integrated Protection",
                "source_name": "ERLW",
                "text": "Your body has built-in defensive layers, which can be enhanced with armor:,[object Object]"
            },
            {
                "race_name": "Warforged",
                "name": "Specialized Design",
                "source_name": "ERLW",
                "text": "You gain one skill proficiency and one tool proficiency of your choice."
            },
            {
                "race_name": "Warforged",
                "name": "Age",
                "source_name": "ERLW",
                "text": "A typical warforged is between two and thirty years old. The maximum warforged lifespan remains a mystery; so far, warforged have shown no signs of deterioration due to age. You are immune to magical aging effects."
            },
            {
                "race_name": "Warforged",
                "name": "Constructed Resilience",
                "source_name": "ERLW",
                "text": "You were created to have remarkable fortitude, represented by the following benefits:,[object Object]"
            }
        ]
    },
    {
        "type": "race",
        "name": "Gnoll",
        "speed": "0",
        "str": "2",
        "int": "-2",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Gnoll",
                "name": "Rampage",
                "source_name": "DMG",
                "text": "When you reduce a creature to 0 hit points with a melee attack on your turn, you can take a bonus action to move up to half your speed and make a bite attack."
            },
            {
                "race_name": "Gnoll",
                "name": "Darkvision",
                "source_name": "DMG",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Gnoll",
                "name": "Bite",
                "source_name": "DMG",
                "text": "Your fanged maw is a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to {@damage 1d4} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
            }
        ]
    },
    {
        "type": "race",
        "name": "Lizardfolk",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Lizardfolk",
                "name": "Hungry Jaws",
                "source_name": "MPMM",
                "text": "You can throw yourself into a feeding frenzy. As a bonus action, you can make a special attack with your Bite. If the attack hits, it deals its normal damage, and you gain temporary hit points equal to your proficiency bonus. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Hold Breath",
                "source_name": "MPMM",
                "text": "You can hold your breath for up to 15 minutes at a time."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Nature's Intuition",
                "source_name": "MPMM",
                "text": "Thanks to your mystical connection to nature, you gain proficiency with two of the following skills of your choice: {@skill Animal Handling}, {@skill Medicine}, {@skill Nature}, {@skill Perception}, {@skill Stealth}, or {@skill Survival}."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Natural Armor",
                "source_name": "MPMM",
                "text": "You have tough, scaly skin. When you aren't wearing armor, your base AC is 13 + Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Speed",
                "source_name": "MPMM",
                "text": "Your walking speed is 30 feet, and you have a swimming speed equal to your walking speed."
            },
            {
                "race_name": "Lizardfolk",
                "name": "Bite",
                "source_name": "MPMM",
                "text": "You have a fanged maw that you can use to make unarmed strikes. When you hit with it, the strike deals {@damage 1d6} + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike."
            }
        ]
    },
    {
        "type": "race",
        "name": "Reborn",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "VRGR",
        "RacialTraits": [
            {
                "race_name": "Reborn",
                "name": "Ancestral Legacy",
                "source_name": "VRGR",
                "text": "If you replace a race with this lineage, you can keep the following elements of that race: any skill proficiencies you gained from it and any climbing, flying, or swimming speed you gained from it.,If you don't keep any of those elements or you choose this lineage at character creation, you gain proficiency in two skills of your choice."
            },
            {
                "race_name": "Reborn",
                "name": "Deathless Nature",
                "source_name": "VRGR",
                "text": "You have escaped death, a fact represented by the following benefits:,[object Object]"
            },
            {
                "race_name": "Reborn",
                "name": "Knowledge from a Past Life",
                "source_name": "VRGR",
                "text": "You temporarily remember glimpses of the past, perhaps faded memories from ages ago or a previous life. When you make an ability check that uses a skill, you can roll a {@dice d6} immediately after seeing the number on the {@dice d20} and add the number on the {@dice d6} to the check. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Reborn",
                "name": "Size",
                "source_name": "VRGR",
                "text": "You are Medium or Small. You choose the size when you gain this lineage."
            }
        ]
    },
    {
        "type": "race",
        "name": "Bugbear",
        "speed": "0",
        "str": "2",
        "int": "0",
        "cos": "0",
        "dex": "1",
        "cha": "0",
        "wis": "0",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Bugbear",
                "name": "Age",
                "source_name": "VGM",
                "text": "Bugbears reach adulthood at age 16 and live up to 80 years."
            },
            {
                "race_name": "Bugbear",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common and Goblin."
            },
            {
                "race_name": "Bugbear",
                "name": "Surprise Attack",
                "source_name": "VGM",
                "text": "If you surprise a creature and hit it with an attack on your first turn in combat, the attack deals an extra {@dice 2d6} damage to it. You can use this trait only once per combat."
            },
            {
                "race_name": "Bugbear",
                "name": "Long-Limbed",
                "source_name": "VGM",
                "text": "When you make a melee attack on your turn, your reach for it is 5 feet greater than normal."
            },
            {
                "race_name": "Bugbear",
                "name": "Sneaky",
                "source_name": "VGM",
                "text": "You are proficient in the {@skill Stealth} skill."
            },
            {
                "race_name": "Bugbear",
                "name": "Powerful Build",
                "source_name": "VGM",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
            },
            {
                "race_name": "Bugbear",
                "name": "Size",
                "source_name": "VGM",
                "text": "Bugbears are between 6 and 8 feet tall and weigh between 250 and 350 pounds. Your size is Medium."
            },
            {
                "race_name": "Bugbear",
                "name": "Darkvision",
                "source_name": "VGM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Gith",
        "speed": "0",
        "str": "0",
        "int": "1",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MTF",
        "RacialTraits": [
            {
                "race_name": "Gith",
                "name": "Age",
                "source_name": "MTF",
                "text": "Gith reach adulthood in their late teens and live for about a century."
            },
            {
                "race_name": "Gith",
                "name": "Size",
                "source_name": "MTF",
                "text": "Gith are taller and leaner than humans, with most a slender 6 feet in height."
            },
            {
                "race_name": "Gith",
                "name": "Languages",
                "source_name": "MTF",
                "text": "You can speak, read, and write Common and Gith."
            }
        ]
    },
    {
        "type": "race",
        "name": "Orc",
        "speed": "0",
        "str": "2",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Orc",
                "name": "Age",
                "source_name": "VGM",
                "text": "Orcs reach adulthood at age 12 and live up to 50 years."
            },
            {
                "race_name": "Orc",
                "name": "Size",
                "source_name": "VGM",
                "text": "Orcs are usually over 6 feet tall and weigh between 230 and 280 pounds. Your size is Medium."
            },
            {
                "race_name": "Orc",
                "name": "Powerful Build",
                "source_name": "VGM",
                "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
            },
            {
                "race_name": "Orc",
                "name": "Primal Intuition",
                "source_name": "VGM",
                "text": "You have proficiency in two of the following skills of your choice: {@skill Animal Handling}, {@skill Insight}, {@skill Intimidation}, {@skill Medicine}, {@skill Nature}, {@skill Perception}, and {@skill Survival}."
            },
            {
                "race_name": "Orc",
                "name": "Darkvision",
                "source_name": "VGM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Orc",
                "name": "Aggressive",
                "source_name": "VGM",
                "text": "As a bonus action, you can move up to your movement speed toward a hostile creature you can see or hear. You must end this move closer to the enemy than you started."
            },
            {
                "race_name": "Orc",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common and Orc."
            }
        ]
    },
    {
        "type": "race",
        "name": "Deep Gnome",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Deep Gnome",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Humanoid. You are also considered a gnome for any prerequisite or effect that requires you to be a gnome."
            },
            {
                "race_name": "Deep Gnome",
                "name": "Gnomish Magic Resistance",
                "source_name": "MPMM",
                "text": "You have advantage on Intelligence, Wisdom, and Charisma saving throws against spells."
            },
            {
                "race_name": "Deep Gnome",
                "name": "Svirfneblin Camouflage",
                "source_name": "MPMM",
                "text": "When you make a Dexterity ({@skill Stealth}) check, you can make the check with advantage. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Deep Gnome",
                "name": "Gift of the Svirfneblin",
                "source_name": "MPMM",
                "text": "Starting at 3rd level, you can cast the {@spell disguise self} spell with this trait. Starting at 5th level, you can also cast the {@spell nondetection} spell with it, without requiring a material component. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these using spell slots you have of the appropriate level.,Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
            },
            {
                "race_name": "Deep Gnome",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 120 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Zombie",
        "speed": "0",
        "str": "1",
        "int": "-6",
        "cos": "0",
        "dex": "0",
        "cha": "-4",
        "wis": "-4",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Zombie",
                "name": "Undead Nature",
                "source_name": "DMG",
                "text": "You are immune to poison damage, and you can't be {@condition poisoned}. You don't require air, food, drink, or sleep."
            },
            {
                "race_name": "Zombie",
                "name": "Undead Fortitude",
                "source_name": "DMG",
                "text": "If damage reduces you to 0 hit points, you must make a Constitution saving throw with a DC of 5+the damage taken, unless the damage is radiant or from a critical hit. On a success, you drop to 1 hit point instead."
            },
            {
                "race_name": "Zombie",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can't speak, but you can understand the languages you knew in life."
            },
            {
                "race_name": "Zombie",
                "name": "Darkvision",
                "source_name": "DMG",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            }
        ]
    },
    {
        "type": "race",
        "name": "Orc",
        "speed": "0",
        "str": "2",
        "int": "-2",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Orc",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Common and Orc."
            },
            {
                "race_name": "Orc",
                "name": "Darkvision",
                "source_name": "DMG",
                "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Orc",
                "name": "Aggressive",
                "source_name": "DMG",
                "text": "As a bonus action, you can move up to your speed toward a hostile creature that you can see."
            }
        ]
    },
    {
        "type": "race",
        "name": "Goblin",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "0",
        "source_name": "VGM",
        "RacialTraits": [
            {
                "race_name": "Goblin",
                "name": "Nimble Escape",
                "source_name": "VGM",
                "text": "You can take the {@action Disengage} or {@action Hide} action as a bonus action on each of your turns."
            },
            {
                "race_name": "Goblin",
                "name": "Languages",
                "source_name": "VGM",
                "text": "You can speak, read, and write Common and Goblin."
            },
            {
                "race_name": "Goblin",
                "name": "Darkvision",
                "source_name": "VGM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Goblin",
                "name": "Size",
                "source_name": "VGM",
                "text": "Goblins are between 3 and 4 feet tall and weigh between 40 and 80 pounds. Your size is Small."
            },
            {
                "race_name": "Goblin",
                "name": "Age",
                "source_name": "VGM",
                "text": "Goblins reach adulthood at age 8 and live up to 60 years."
            },
            {
                "race_name": "Goblin",
                "name": "Fury of the Small",
                "source_name": "VGM",
                "text": "When you damage a creature with an attack or a spell and the creature's size is larger than yours, you can cause the attack or spell to deal extra damage to the creature. The extra damage equals your level. Once you use this trait, you can't use it again until you finish a short or long rest."
            }
        ]
    },
    {
        "type": "race",
        "name": "Goblin",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Goblin",
                "name": "Fey Ancestry",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws you make to avoid or end the {@condition charmed} condition on yourself."
            },
            {
                "race_name": "Goblin",
                "name": "Fury of the Small",
                "source_name": "MPMM",
                "text": "When you damage a creature with an attack or a spell and the creature's size is larger than yours, you can cause the attack or spell to deal extra damage to the creature. The extra damage equals your proficiency bonus.,You can use this trait a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest, and you can use it no more than once per turn."
            },
            {
                "race_name": "Goblin",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were in dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Goblin",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Humanoid. You are also considered a goblinoid for any prerequisite or effect that requires you to be a goblinoid."
            },
            {
                "race_name": "Goblin",
                "name": "Nimble Escape",
                "source_name": "MPMM",
                "text": "You can take the {@action Disengage} or {@action Hide} action as a bonus action on each of your turns."
            }
        ]
    },
    {
        "type": "race",
        "name": "Halfling",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "0",
        "source_name": "PHB",
        "RacialTraits": [
            {
                "race_name": "Halfling",
                "name": "Size",
                "source_name": "PHB",
                "text": "Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small."
            },
            {
                "race_name": "Halfling",
                "name": "Languages",
                "source_name": "PHB",
                "text": "You can speak, read, and write Common and Halfling. The Halfling language isn't secret, but halflings are loath to share it with others. They write very little, so they don't have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."
            },
            {
                "race_name": "Halfling",
                "name": "Age",
                "source_name": "PHB",
                "text": "A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century."
            },
            {
                "race_name": "Halfling",
                "name": "Halfling Nimbleness",
                "source_name": "PHB",
                "text": "You can move through the space of any creature that is of a size larger than yours."
            },
            {
                "race_name": "Halfling",
                "name": "Brave",
                "source_name": "PHB",
                "text": "You have advantage on saving throws against being {@condition frightened}."
            },
            {
                "race_name": "Halfling",
                "name": "Lucky",
                "source_name": "PHB",
                "text": "When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."
            }
        ]
    },
    {
        "type": "race",
        "name": "Hobgoblin",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Hobgoblin",
                "name": "Darkvision",
                "source_name": "MPMM",
                "text": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Hobgoblin",
                "name": "Fey Ancestry",
                "source_name": "MPMM",
                "text": "You have advantage on saving throws you make to avoid or end the {@condition charmed} condition on yourself."
            },
            {
                "race_name": "Hobgoblin",
                "name": "Fortune from the Many",
                "source_name": "MPMM",
                "text": "If you miss with an attack roll or fail an ability check or a saving throw, you can draw on your bonds of reciprocity to gain a bonus to the roll equal to the number of allies you can see within 30 feet of you (maximum bonus of +3). You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Hobgoblin",
                "name": "Fey Gift",
                "source_name": "MPMM",
                "text": "You can use this trait to take the {@action Help} action as a bonus action, and you can do so a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.,Starting at 3rd level, choose one of the options below each time you take the {@action Help} action with this trait:,[object Object]"
            },
            {
                "race_name": "Hobgoblin",
                "name": "Creature Type",
                "source_name": "MPMM",
                "text": "You are a Humanoid.You are also considered a goblinoid for any prerequisite or effect that requires you to be a goblinoid."
            }
        ]
    },
    {
        "type": "race",
        "name": "Goliath",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Goliath",
                "name": "Little Giant",
                "source_name": "MPMM",
                "text": "You have proficiency in the {@skill Athletics} skill, and you count as one size larger when determining your carrying weight and the weight you can push, drag, or lift."
            },
            {
                "race_name": "Goliath",
                "name": "Stone's Endurance",
                "source_name": "MPMM",
                "text": "You can supernaturally draw on unyielding stone to shrug off harm. When you take damage, you can use your reaction to roll a {@dice d12}. Add your Constitution modifier to the number rolled and reduce the damage by that total.,You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Goliath",
                "name": "Mountain Born",
                "source_name": "MPMM",
                "text": "You have resistance to cold damage. You also naturally acclimate to high altitudes, even if you've never been to one. This includes elevations above 20,000 feet."
            }
        ]
    },
    {
        "type": "race",
        "name": "Gnome",
        "speed": "0",
        "str": "0",
        "int": "2",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "PHB",
        "RacialTraits": [
            {
                "race_name": "Gnome",
                "name": "Age",
                "source_name": "PHB",
                "text": "Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years."
            },
            {
                "race_name": "Gnome",
                "name": "Darkvision",
                "source_name": "PHB",
                "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            {
                "race_name": "Gnome",
                "name": "Size",
                "source_name": "PHB",
                "text": "Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small."
            },
            {
                "race_name": "Gnome",
                "name": "Gnome Cunning",
                "source_name": "PHB",
                "text": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."
            },
            {
                "race_name": "Gnome",
                "name": "Languages",
                "source_name": "PHB",
                "text": "You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world."
            }
        ]
    },
    {
        "type": "race",
        "name": "Owlin",
        "speed": "30",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "SCC",
        "RacialTraits": [
            {
                "race_name": "Owlin",
                "name": "Darkvision",
                "source_name": "SCC",
                "text": "You can see in dim light within 120 feet of yourself as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
            },
            {
                "race_name": "Owlin",
                "name": "Silent Feathers",
                "source_name": "SCC",
                "text": "You have proficiency in the {@skill Stealth} skill."
            },
            {
                "race_name": "Owlin",
                "name": "Size",
                "source_name": "SCC",
                "text": "You are Medium or Small. You choose the size when you select this race."
            },
            {
                "race_name": "Owlin",
                "name": "Flight",
                "source_name": "SCC",
                "text": "Thanks to your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor."
            }
        ]
    },
    {
        "type": "race",
        "name": "Aarakocra",
        "speed": "20",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "2",
        "cha": "0",
        "wis": "2",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Aarakocra",
                "name": "Language",
                "source_name": "DMG",
                "text": "You can speak, read, and write Auran."
            },
            {
                "race_name": "Aarakocra",
                "name": "Talons",
                "source_name": "DMG",
                "text": "You are proficient with your unarmed strikes, which deal {@damage 1d4} slashing damage on a hit."
            },
            {
                "race_name": "Aarakocra",
                "name": "Dive Attack",
                "source_name": "DMG",
                "text": "If you are flying and dive at least 30 ft. straight toward a target and then hit it with a melee weapon attack, the attack deals an extra {@dice 1d6} damage to the target."
            }
        ]
    },
    {
        "type": "race",
        "name": "Harengon",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Harengon",
                "name": "Leporine Senses",
                "source_name": "MPMM",
                "text": "You have proficiency in the {@skill Perception} skill."
            },
            {
                "race_name": "Harengon",
                "name": "Rabbit Hop",
                "source_name": "MPMM",
                "text": "As a bonus action, you can jump a number of feet equal to five times your proficiency bonus, without provoking opportunity attacks. You can use this trait only if your speed is greater than 0. You can use it a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            },
            {
                "race_name": "Harengon",
                "name": "Size",
                "source_name": "MPMM",
                "text": "You are Medium or Small. You choose the size when you select this race."
            },
            {
                "race_name": "Harengon",
                "name": "Hare-Trigger",
                "source_name": "MPMM",
                "text": "You can add your proficiency bonus to your initiative rolls."
            },
            {
                "race_name": "Harengon",
                "name": "Lucky Footwork",
                "source_name": "MPMM",
                "text": "When you fail a Dexterity saving throw, you can use your reaction to roll a {@dice d4} and add it to the save, potentially turning the failure into a success. You can't use this reaction if you're {@condition prone} or your speed is 0."
            }
        ]
    },
    {
        "type": "race",
        "name": "Githzerai",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MPMM",
        "RacialTraits": [
            {
                "race_name": "Githzerai",
                "name": "Psychic Resilience",
                "source_name": "MPMM",
                "text": "You have resistance to psychic damage."
            },
            {
                "race_name": "Githzerai",
                "name": "Mental Discipline",
                "source_name": "MPMM",
                "text": "Your innate psychic defenses grant you advantage on saving throws you make to avoid or end the {@condition charmed} and {@condition frightened} conditions on yourself."
            },
            {
                "race_name": "Githzerai",
                "name": "Githzerai Psionics",
                "source_name": "MPMM",
                "text": "You know the {@spell mage hand} cantrip, and the hand is {@condition invisible} when you cast the cantrip with this trait.,Starting at 3rd level, you can cast the {@spell shield} spell with this trait. Starting at 5th level, you can also cast the {@spell detect thoughts} spell with it. Once you cast {@spell shield} or {@spell detect thoughts} spell with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.,Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race). None of these spells require spell components when you cast them with this trait."
            }
        ]
    },
    {
        "type": "race",
        "name": "Grimlock",
        "speed": "0",
        "str": "2",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "-2",
        "wis": "0",
        "source_name": "DMG",
        "RacialTraits": [
            {
                "race_name": "Grimlock",
                "name": "Stone Camouflage",
                "source_name": "DMG",
                "text": "You have advantage on Dexterity ({@skill Stealth}) checks made to hide in rocky terrain."
            },
            {
                "race_name": "Grimlock",
                "name": "Languages",
                "source_name": "DMG",
                "text": "You can speak, read, and write Undercommon."
            },
            {
                "race_name": "Grimlock",
                "name": "Blindsight",
                "source_name": "DMG",
                "text": "You have no eyes, and cannot be {@condition blinded}. You can perceive your surroundings within 30 ft., or 10 ft. while {@condition deafened}. You are considered blind beyond this radius."
            },
            {
                "race_name": "Grimlock",
                "name": "Keen Hearing and Smell",
                "source_name": "DMG",
                "text": "You have advantage on Wisdom ({@skill Perception}) checks that rely on hearing or smell."
            }
        ]
    },
    {
        "type": "race",
        "name": "Goblin",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "ERLW",
        "RacialTraits": []
    },
    {
        "type": "race",
        "name": "Minotaur",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MOT",
        "RacialTraits": []
    },
    {
        "type": "race",
        "name": "Goblin",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "GGR",
        "RacialTraits": []
    },
    {
        "type": "race",
        "name": "Orc",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "EGW",
        "RacialTraits": []
    },
    {
        "type": "race",
        "name": "Triton",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MOT",
        "RacialTraits": []
    },
    {
        "type": "race",
        "name": "Hobgoblin",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "ERLW",
        "RacialTraits": []
    },
    {
        "type": "race",
        "name": "Centaur",
        "speed": "0",
        "str": "0",
        "int": "0",
        "cos": "0",
        "dex": "0",
        "cha": "0",
        "wis": "0",
        "source_name": "MOT",
        "RacialTraits": []
    }
]